{"source_url": "https://www.drugs.com/compare/", "site": "drugs.com", "generic_name": "Compare Drugs", "brand_names": null, "indications": "See how your medications stack up against each other. View side-by-side comparisons of medication uses, ratings & reviews, prices, FDA alerts, side effects, drug interactions, approval dates, classification, generic availability and more.", "mechanism": null, "dosage": null, "side_effects": "See how your medications stack up against each other. View side-by-side comparisons of medication uses, ratings & reviews, prices, FDA alerts, side effects, drug interactions, approval dates, classification, generic availability and more.", "interactions": "See how your medications stack up against each other. View side-by-side comparisons of medication uses, ratings & reviews, prices, FDA alerts, side effects, drug interactions, approval dates, classification, generic availability and more.", "raw_excerpt": "Drug Comparison Tool - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Compare Drugs See how your medications stack up against each other. View side-by-side comparisons of medication uses, ratings & reviews, prices, FDA alerts, side effects, drug interactions, approval dates, classification, generic availability and more. Get started Enter a drug name to compare Start typing the name of a medication. A list of suggestions will appear; please select from the list. Popular comparisons Compare top drugs by medic"}
{"source_url": "https://www.drugs.com/alpha/e.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'E' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z E Drugs: E List of drugs and medications that start with the letter ' E '. Ea Eb Ec Ed Ee Ef Eg Eh Ei Ej Ek El Em En Eo Ep Eq Er Es Et Eu Ev Ew Ex Ey Ez 0-9 Most Common 'E' Drugs Common medications that begin with the letter ' E ' Patient Info Professional Monographs Ebglyss Effexor Effexor XR Elagolix Elavil Elevidys Eligard Eliquis Emgality Empagliflozin Empaveli Enalapril Enbrel Enhertu Enoxaparin Enspryng"}
{"source_url": "https://www.drugs.com/penicillin.html", "site": "drugs.com", "generic_name": "Penicillin V", "brand_names": "Veetids", "indications": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use this medication only for the indication prescribed.", "mechanism": null, "dosage": null, "side_effects": "Get emergency medical help if you have any of these signs of an allergic reaction to penicillin V: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. Call your doctor at once if you have any of these serious side effects: diarrhea that is watery or bloody; fever, chills, body aches, flu symptoms; easy bruising or bleeding, unusual weakness; urinating less than usual or not at all; severe skin rash, itching, or peeling; agitation, confusion, unusual thoughts or behavior; or seizure (black-out or convulsions). Less serious penicillin V side effects are more likely to occur, such as: nausea, vomiting, stomach pain; vaginal itching or discharge; headache; swollen, black, or \"hairy\" tongue; or thrush (white patches or inside your mouth or throat). This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Penicillin v potassium side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Penicillin Uses, Side Effects & Allergy Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Penicillin v potassium Print Save Penicillin V Play pronunciation Generic name: penicillin V [ pen-i-SILL-in ] Brand names: PC Pen VK, Pen-V Drug class: Natural penicillins Medically reviewed by Melisa Puckey, BPharm . Last updated on May 3, 2024. Uses Warnings Before taking Dosage Side effects Interactions What is penicillin V? Penicillins are a group of antibiotics that fight bacteria and was originally d"}
{"source_url": "https://www.drugs.com/sotyktu.html", "site": "drugs.com", "generic_name": "Sotyktu", "brand_names": null, "indications": "Plaque psoriasis is a chronic autoimmune skin condition that has itchy and painful patches of skin that are thickened, red, and typically covered by silvery-white scales. One of the causes of plaque psoriasis involves a protein called tyrosine kinase 2 (TYK2), which works with proteins (IL-23 and IL-17) in your immune system to cause the formation of plaque psoriasis. Sotyktu works by blocking TYK2, which means there is less IL-23 and IL-17, which helps clear up psoriasis plaques on the skin and scalp", "mechanism": null, "dosage": "Pronunciation: soh-tik-too Generic name: deucravacitinib Dosage form: tablets (6mg) Drug class: Selective immunosuppressants", "side_effects": "The common Sotyktu side effects are acne, cold symptoms (stuffy nose, sneezing, sore throat), cold sores, sores on your gums, tongue, or mouth, hair follicle infection, or inflammation (folliculitis). These side effects occurred in 1% or more of patients in clinical trials.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Sotyktu: Uses, Side Effects, Dosage Reviews and More Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Sotyktu Print Save Sotyktu Play pronunciation Pronunciation: soh-tik-too Generic name: deucravacitinib Dosage form: tablets (6mg) Drug class: Selective immunosuppressants Medically reviewed by Melisa Puckey, BPharm . Last updated on Sep 25, 2024. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Sotyktu? Sotyktu (deucravacitinib) is used to treat moderate to severe plaque psoriasis"}
{"source_url": "https://www.drugs.com/symptom-checker/", "site": "drugs.com", "generic_name": "Symptom Checker", "brand_names": null, "indications": "Disclaimer: Medical conditions are suggested as possible causes based on matching your symptoms with our database. Resulting lists are not in order of how clinically relevant these conditions are for you. Always consult your healthcare provider. This content should not be considered complete and should not be used in place of a call or visit to a healthcare professional. Use of this content is subject to our terms of use & medical disclaimer.", "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Symptom Checker - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Symptom Checker What are your symptoms? Gender -- Select -- Female Male Age -- Select -- 0 - 28 days (Newborn) 29 days - 1 year (Infant) 1 - 5 yrs (Younger child) 6 - 12 yrs (Older child) 13 - 16 yrs (Adolescent) 17 - 29 yrs (Young adult) 30 - 39 yrs (Adult) 40 - 49 yrs (Adult) 50 - 64 yrs (Adult) 65+ over (Senior) Are you pregnant? Don't know Not pregnant Pregnant Country -- Select -- ----- United Kingdom United States ----- Afghanistan Å"}
{"source_url": "https://www.drugs.com/history/armlupeg.html", "site": "drugs.com", "generic_name": "Armlupeg FDA Approval History", "brand_names": "Armlupeg", "indications": null, "mechanism": null, "dosage": "FDA Approved: Yes (First approved November 28, 2025) Brand name: Armlupeg Generic name: pegfilgrastim-unne Dosage form: Injection Company: Lupin Limited Treatment for: Neutropenia Associated with Chemotherapy, Neutropenia Associated with Radiation", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Armlupeg (pegfilgrastim-unne) FDA Approval History - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home FDA History Armlupeg Print Save Armlupeg FDA Approval History FDA Approved: Yes (First approved November 28, 2025) Brand name: Armlupeg Generic name: pegfilgrastim-unne Dosage form: Injection Company: Lupin Limited Treatment for: Neutropenia Associated with Chemotherapy , Neutropenia Associated with Radiation Armlupeg (pegfilgrastim-unne) is a PEGylated growth colony-stimulating factor biosimilar to Neula"}
{"source_url": "https://www.drugs.com/epclusa.html", "site": "drugs.com", "generic_name": "Epclusa", "brand_names": null, "indications": "Hepatitis C is a viral disease that causes inflammation of the liver that can lead to a decrease in liver function or liver failure. HCV infection can become chronic (long-lasting) and, over many years, may cause complications, such as bleeding, jaundice (yellowish eyes or skin), fluid accumulation in the abdomen, infections, liver cancer, and death. When Eplusa was taken in chronic HCV patients with mild or no cirrhosis, results of studies showed that 95–99 percent of patients had no virus detected in the blood 12 weeks after finishing treatment.", "mechanism": null, "dosage": "Pellets should be swallowed whole. Do not chew pellets. Do not open the oral pellet packet(s) until ready to use. For children younger than 6 years, take oral pellets with food. Epclusa oral pellets are white to off-white pellets supplied as single-use packets in cartons. Doses are based on weight in children and teenagers. The dose may change if the child gains or loses weight. If you've had hepatitis B, it may come back or get worse. You may need liver function tests while using this medicine and for several months after you stop. You should not stop using Epclusa suddenly, or your hepatitis C could become harder to treat with antiviral medicine. Use all medications as directed. Do not change your dose or stop using a medicine without your doctor's advice. Remain under the care of a doctor. Epclusa patient tips (more detail)", "side_effects": "Common Epclusa side effects may include: headache, tiredness, nausea, vomiting, sleep problems (insomnia), diarrhea, low red blood cells (anemia) in people with cirrhosis, pale skin, tiredness, feeling light-headed or short of breath, cold hands and feet. Serious Epclusa side effects Get emergency medical help if you have signs of an allergic reaction to Epclusa with symptoms of hives, difficulty breathing, and swelling of your face, lips, tongue, or throat. Call your doctor at once if you have new or worsening symptoms such as: right-sided upper stomach pain; vomiting, loss of appetite, not feeling well; or jaundice (yellowing of the skin or eyes). If you also take a heart rhythm medicine called amiodarone: Taking amiodarone with Epclusa can cause dangerous side effects on your heart. Get medical help right away if you take this medicine and you have: very slow heartbeats, chest pain, shortness of breath; confusion, memory problems; or weakness, extreme tiredness, and light-headed feeling (like you might pass out). This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to the FDA at 1-800-FDA-1088.) Epclusa side effects (more detail)", "interactions": "Pegasys is used to treat chronic hepatitis B or C. Learn about side effects, interactions and ...", "raw_excerpt": "Epclusa for Hep C: Uses, Dosage, Side Effects & Warnings Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Epclusa Print Save Epclusa Play pronunciation Pronunciation: ep-KLOO-suh Generic name: sofosbuvir/velpatasvir Dosage form: oral pellet (150 mg-37.5 mg; 200 mg-50 mg), oral tablet (200 mg-50 mg; 400 mg-100 mg) Drug class: Antiviral combinations Medically reviewed by Melisa Puckey, BPharm . Last updated on April 12, 2024. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Epclusa? Epclusa is"}
{"source_url": "https://www.drugs.com/methotrexate.html", "site": "drugs.com", "generic_name": "Methotrexate", "brand_names": "Trexall, Otrexup, Rasuvo, Rheumatrex Dose Pack, ... +3 more", "indications": "Get emergency medical help if you have signs of an allergic reaction to methotrexate: (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning in your eyes, skin pain, red or purple skin rash that spreads and causes blistering and peeling).", "mechanism": null, "dosage": null, "side_effects": "Common methotrexate side effects may include: fever, chills, tiredness, not feeling well; low blood cell counts; mouth sores; nausea, stomach pain; abnormal liver function tests; hair loss; burning skin lesions; or being more sensitive to light.", "interactions": "Many drugs can interact with methotrexate. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed here. Tell your doctor about all your current medicines and any medicine you start or stop using.", "raw_excerpt": "Methotrexate: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Methotrexate Print Save Methotrexate Play pronunciation Generic name: methotrexate (oral) [ meth-oh-TREX-ate ] Brand names: Trexall , Xatmep Jylamvo Drug classes: Antimetabolites , Antipsoriatics , Antirheumatics , Other immunosuppressants Medically reviewed by Sophia Entringer, PharmD . Last updated on Oct 31, 2024. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is methotrexate? Me"}
{"source_url": "https://www.drugs.com/vyvanse.html", "site": "drugs.com", "generic_name": "Vyvanse", "brand_names": "Arynta", "indications": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use Vyvanse only for the indication prescribed.", "mechanism": null, "dosage": "Pronunciation: Vi' – vans Generic name: lisdexamfetamine [ lis-dex-am-FET-a-meen ] Dosage form: capsules, chewable tablets Drug class: CNS stimulants", "side_effects": "Get emergency medical help if you have signs of an allergic reaction to Vyvanse: hives; difficult breathing; swelling of your face, lips, tongue, or throat. Call your doctor at once if you have: signs of heart problems - chest pain, trouble breathing, pounding heartbeats or fluttering in your chest, feeling like you might pass out; signs of psychosis - hallucinations (seeing or hearing things that are not real), new behavior problems, aggression, hostility, paranoia; or signs of circulation problems - numbness, pain, cold feeling, unexplained wounds, or skin color changes (pale, red, or blue appearance) in your fingers or toes. Seek medical attention right away if you have symptoms of serotonin syndrome, such as: agitation, hallucinations, fever, sweating, shivering, fast heart rate, muscle stiffness, twitching, loss of coordination, nausea, vomiting, or diarrhea. Vyvanse can affect growth in children. Tell your doctor if your child is not growing at a normal rate while using this medicine. Common Vyvanse side effects may include: dry mouth, loss of appetite, weight loss; sleep problems (insomnia); fast heart rate, feeling jittery; dizziness, feeling anxious or irritable; or nausea, vomiting, stomach pain, diarrhea, constipation. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Vyvanse side effects (more detail)", "interactions": "Other drugs may interact with lisdexamfetamine, including prescription and over-the-counter medicines, vitamins, and herbal products. Tell your doctor about all your current medicines and any medicine you start or stop using. This is not a complete list of drug interactions, and others may occur.", "raw_excerpt": "Vyvanse Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Vyvanse Print Save Vyvanse Play pronunciation Pronunciation: Vi' – vans Generic name: lisdexamfetamine [ lis-dex-am-FET-a-meen ] Dosage form: capsules, chewable tablets Drug class: CNS stimulants Medically reviewed by Melisa Puckey, BPharm . Last updated on Nov 19, 2025. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Vyvanse? Vyvanse is a central nervous system stimulant that works on"}
{"source_url": "https://www.drugs.com/komzifti.html", "site": "drugs.com", "generic_name": "Komzifti", "brand_names": "Komzifti", "indications": null, "mechanism": null, "dosage": "Pronunciation: kom-ZIF-tee Generic name: ziftomenib Dosage form: capsules (200 mg)", "side_effects": "The most common side effects of Komzifti are: Infections (including bacterial infections) Bleeding Diarrhea Nausea Fatigue Swelling in arms and legs Muscle, bone, and joint pain Itching Fever with low white blood cell count (febrile neutropenia) Abnormal liver function tests. Your doctor may adjust your dose, temporarily stop, or discontinue treatment if you develop certain side effects. This is not a complete list of side effects. Report side effects to your doctor or the FDA at 1-800-FDA-1088.", "interactions": "Komzifti can interact with several types of medications. Tell your healthcare provider about all drugs you take, including prescription and over-the-counter medicines, vitamins, and herbal supplements. CYP3A4 inhibitors (avoid or monitor closely): Strong or moderate CYP3A4 inhibitors may increase Komzifti levels in your blood. Your doctor will monitor you more frequently for side effects. Examples: Ketoconazole, itraconazole, clarithromycin, ritonavir, grapefruit juice CYP3A4 inducers (avoid): These medications can decrease Komzifti's effectiveness. Avoid taking together. Examples: Rifampin, phenytoin, carbamazepine, St. John's wort Proton pump inhibitors/PPIs (avoid): PPIs significantly reduce Komzifti absorption. Do not take together. Examples: Omeprazole (Prilosec), esomeprazole (Nexium), lansoprazole (Prevacid), pantoprazole (Protonix) H2 blockers and antacids (separate dosing): If you must take these, timing is critical: H2 blockers: Take Komzifti 2 hours before or 10 hours after (examples: famotidine, ranitidine) Antacids: Take Komzifti 2 hours before or 2 hours after (examples: calcium carbonate, Tums, Maalox) QT-prolonging drugs (avoid or monitor): Medications that affect heart rhythm increase the risk of dangerous irregular heartbeats when combined with Komzifti. If unavoidable, your doctor will monitor your heart more frequently with ECGs. Examples: Azithromycin, ondansetron, haloperidol, amiodarone, sotalol, certain antipsychotics, and antidepressants Keep a list of all your medications to show your healthcare provider and pharmacist. Does Komzifti interact with my other drugs? Enter medications to view a detailed interaction report using our Drug Interaction Checker. Drug name Add a drug to check interactions Add", "raw_excerpt": "Komzifti Information from Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Komzifti Print Save Komzifti Pronunciation: kom-ZIF-tee Generic name: ziftomenib Dosage form: capsules (200 mg) Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 17, 2025. Uses Overview Warnings Side effects Before taking Interactions What is Komzifti? AML treatment Komzifti (ziftomenib) is used to treat relapsed or refractory acute myeloid leukemia (AML) with a nucleophosmin 1 (NPM1) mutation in adults who have no ot"}
{"source_url": "https://www.drugs.com/voyxact.html", "site": "drugs.com", "generic_name": "Voyxact", "brand_names": null, "indications": "Voyxact (sibeprenlimab-szsi) works by blocking a protein called APRIL that causes harmful antibodies to build up and damage the kidneys of people with IgAN.", "mechanism": null, "dosage": "Pronunciation: voy-zakt Generic name: sibeprenlimab-szsi Dosage form: single-dose prefilled syringe for subcutaneous use (400 mg/2 mL)", "side_effects": "Voyxact can cause the following serious side effects.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Voyxact: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Voyxact Print Save Voyxact Pronunciation: voy-zakt Generic name: sibeprenlimab-szsi Dosage form: single-dose prefilled syringe for subcutaneous use (400 mg/2 mL) Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 27, 2025. Uses Overview Side effects Before taking Dosage Missed dose What is Voyxact? Voyxact injection is used to reduce protein in the urine (proteinuria) in adults with primary immuno"}
{"source_url": "https://www.drugs.com/praluent.html", "site": "drugs.com", "generic_name": "Praluent", "brand_names": null, "indications": "The differences between Repatha (evolocumab) and Praluent (alirocumab) are their active ingredients, number of treatment indications, dosage forms available and number of strengths available in syringe and pens forms. Continue reading", "mechanism": null, "dosage": "If your healthcare provider prescribes you the monthly dose, give 2 separate injections in a row, using a different pen for each injection and 2 different injection sites. Do not inject it with other injectable medicines at the same injection site. Always check the label of your pen to make sure you have the correct medicine and the correct dose If your healthcare provider decides that you or a caregiver can give the injections of Praluent, you or your caregiver should receive training on the right way to prepare and give it. Do not try to inject Praluent until you have been shown the right way by your healthcare provider or nurse. In children aged 12 to 17 years, Praluent should be given by or under the supervision of an adult. In children aged 8 to 11 years, Praluent should be given by a caregiver. Do not stop using Praluent without talking with your healthcare provider. If you stop using it, your cholesterol levels can increase. Praluent patient tips (more detail)", "side_effects": "Praluent can cause serious side effects, including: allergic reactions. These can be severe and require treatment in a hospital. Stop using Praluent and call your healthcare provider or go to the nearest hospital emergency room right away if you have any symptoms of an allergic reaction including: a severe rash severe itching redness or swelling of the face trouble breathing lips, throat, or tongue hives. Common side effects of Praluent affecting more than 5% of patients include: redness, itching, swelling, pain, or tenderness at the injection site muscle pain flu or flu-like symptoms muscle spasms diarrhea bruising. Tell your healthcare provider if you have any side effect that bothers you or that does not go away. These are not all of the possible side effects of Praluent. Ask your healthcare provider or pharmacist for more information. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Praluent side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Praluent Injection: Uses, Dosage, Warnings, & Side Effects - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Praluent Print Save Praluent Play pronunciation Pronunciation: PRAHL-u-ent Generic name: alirocumab Dosage form: Prefilled pen (autoinjector) for subcutaneous use Drug class: PCSK9 inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on March 12, 2024. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Praluent? Praluent (alirocumab) is an injectable medicine t"}
{"source_url": "https://www.drugs.com/prednisone.html", "site": "drugs.com", "generic_name": "Prednisone", "brand_names": "Deltasone, Rayos, Sterapred, Prednicot, Sterapred DS", "indications": "any illness that causes diarrhea;", "mechanism": null, "dosage": "Your dosage needs may change if you have any unusual stress such as a serious illness, fever or infection, or if you have surgery or a medical emergency. Do not change your medication dose or schedule without your doctor's advice.", "side_effects": "Get emergency medical help if you have any of these signs of an allergic reaction to prednisone: hives; difficult breathing; swelling of your face, lips, tongue, or throat. Call your doctor at once if you have: blurred vision, eye pain, or seeing halos around lights; swelling, rapid weight gain, feeling short of breath; severe depression, feelings of extreme happiness or sadness, changes in personality or behavior, seizure (convulsions); bloody or tarry stools, coughing up blood; pancreatitis (severe pain in your upper stomach spreading to your back, nausea and vomiting, fast heart rate); low potassium (confusion, uneven heart rate, extreme thirst, increased urination, leg discomfort, muscle weakness or limp feeling); or dangerously high blood pressure (severe headache, blurred vision, buzzing in your ears, anxiety, confusion, chest pain, shortness of breath, uneven heartbeats, seizure). Other common prednisone side effects may include: sleep problems (insomnia), mood changes; increased appetite, gradual weight gain; acne, increased sweating, dry skin, thinning skin, bruising or discoloration; slow wound healing; headache, dizziness, spinning sensation; nausea, stomach pain, bloating; or changes in the shape or location of body fat (especially in your arms, legs, face, neck, breasts, and waist). This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Prednisone side effects (more detail)", "interactions": "Many drugs can interact with prednisone. Not all possible interactions are listed here. Tell your doctor about all your medications and any you start or stop using during treatment with prednisone, especially:", "raw_excerpt": "Prednisone Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Prednisone Print Save Prednisone Play pronunciation Pronunciation: PRED-ni-sone Generic name: prednisone Brand names: Rayos , Sterapred , Deltasone Drug class: Glucocorticoids Medically reviewed by Melisa Puckey, BPharm . Last updated on May 13, 2025. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is prednisone? Prednisone is a corticosteroid medicine used to decrease inflammation and"}
{"source_url": "https://www.drugs.com/support/contact.html", "site": "drugs.com", "generic_name": "Contact Drugs.com", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Contact Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Support Contact Contact Drugs.com If you're facing a medical emergency, call your local emergency services immediately, or visit the nearest emergency room or urgent care center. Do you have a medical question? Drugs.com is unable to respond to individual drug information requests or provide personal health advice. However, we can offer the following tools: Symptom Checker Pill Identifier Drug Interaction Checker Personal Medication Record For more"}
{"source_url": "https://www.drugs.com/clinical_trials.html", "site": "drugs.com", "generic_name": "Clinical Trial News & Results", "brand_names": null, "indications": null, "mechanism": null, "dosage": "Boston, MA – November 17, 2025 – Dewpoint Therapeutics announced today that the U.S. Food and Drug Administration (FDA) has granted Fast Track...", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Clinical Trial News & Results Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News Clinical Trials Clinical Trial News & Results All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Search Search This section provides information about recently completed clinical trials. If you cannot find information about a particular clinical trial, you should note that results may not be available even after the trial ends. Some trials end before completion and results are never published. Protagonist and Takeda"}
{"source_url": "https://www.drugs.com/availability/", "site": "drugs.com", "generic_name": "Generic Drugs", "brand_names": null, "indications": "A generic drug is equivalent to its brand name counterpart, but is usually much less expensive. A generic drug must have the same active ingredients, route of administration, dosage form, strength, and indications as the original brand product. Generic drugs are approved by the U.S. Food and Drug Administration, and are deemed to be as safe and effective as the brand name product.", "mechanism": null, "dosage": "Brand name prescription medications are approved by the U.S. Food and Drug Administration and may be covered by legal patents that delay the availability of lower cost generic substitutes. Fraudulent online pharmacies may attempt to sell illegal \"generic\" versions of these brand name medications. These medications may be counterfeit and potentially unsafe. If you purchase medications online, be sure you are buying from a reputable and valid online pharmacy. Ask your health care provider for advice if you are unsure about the online purchase of any medication.", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Generic Drugs - Availability and Patent Status | Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Generic Drugs - Availability and Patent Status Access information on the availability of generic medications for over 1,400 brand drugs, including FDA approval dates, manufacturer details, and patent information. Latest generic approvals Generic vs brand drugs New drug approvals Get new drug approvals by email Search generic drugs Search Search Top generic related searches Abilify Adderall Advair Diskus Ambien Cia"}
{"source_url": "https://www.drugs.com/ambien.html", "site": "drugs.com", "generic_name": "Ambien", "brand_names": "Zolpimist, Intermezzo, Edluar", "indications": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use Ambien only for the indication prescribed.", "mechanism": null, "dosage": "Even though Ambien (zolpidem) is not as habit-forming as benzodiazepines, it is still addictive. When Ambien was first discovered, scientists thought it unlikely to cause tolerance, dependence, or be misused like benzodiazepines. But they were wrong. Physical dependence on the drug can develop within a couple of weeks, even when it is used at the dosages recommended. Ambien should only be used for short periods to help with sleep (ideally no more than seven to ten days). If you've been taking Ambien for longer or taking higher dosages than recommended, you may struggle with medication withdrawal symptoms when you try to quit. Continue reading", "side_effects": "Zolpidem may cause a severe allergic reaction. Stop taking Ambien and get emergency medical help if you have signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. Report any new or worsening symptoms to your doctor, such as: depression, anxiety, aggression, agitation, confusion, unusual thoughts, hallucinations, memory problems, changes in personality, risk-taking behavior, decreased inhibitions, no fear of danger, or thoughts of suicide or hurting yourself. Stop using this medicine and call your doctor at once if you have: chest pain, fast or irregular heartbeat, feeling short of breath; trouble breathing or swallowing; or feeling like you might pass out. The sedative effect of Ambien may be stronger in older adults. Dizziness or severe drowsiness can cause falls, accidents, or severe injuries. Common Ambien side effects may include: daytime drowsiness, dizziness, weakness, feeling \"drugged\" or light-headed; tired feeling, loss of coordination; stuffy nose, dry mouth, nose or throat irritation; nausea, constipation, diarrhea, upset stomach; or headache, muscle pain. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Ambien side effects (more detail)", "interactions": "Belsomra (suvorexant) is used to treat insomnia. Includes Belsomra side effects, interactions and ...", "raw_excerpt": "Ambien Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Ambien Print Save Ambien Play pronunciation Pronunciation: am-bee-uhn Generic name: zolpidem Other brand names of zolpidem include: Ambien, Ambien CR Drug class: Miscellaneous anxiolytics, sedatives and hypnotics Medically reviewed by Melisa Puckey, BPharm . Last updated on Feb 29, 2024. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Ambien? Ambien is a sedative, also called a hypnotic"}
{"source_url": "https://www.drugs.com/support/terms.html", "site": "drugs.com", "generic_name": "Terms and Conditions", "brand_names": "No page from this website may be copied, reproduced, republished, uploaded, posted, transmitted, framed, commercialized, distributed in any way, or incorporated into any other website or electronic or mechanical information retrieval system, except that You may download one copy of the viewed materials on any single computer for Your personal, non-commercial home use only (but not for resale or redistribution), provided You keep intact all copyright and other proprietary notices. Modification of the materials or use of the materials for any other purpose is a violation of the content provider's copyright and other proprietary rights. The use of any such material on any other website or networked computer environment is prohibited. All rights, title and interest in and to the materials on this site (including but not limited to all copyrights, trademarks, service marks, trade names and all derivative works) are owned or controlled by and shall remain at all time vested in Drugs.com or its content providers.", "indications": "Prohibited Uses: Data Scraping and Dataset Creation You are expressly prohibited from engaging in any activity that involves the automated downloading, scraping, or extraction of content from this website, including but not limited to the use of bots, scripts, or other automated tools or technologies. This prohibition applies to the collection, storage, or creation of datasets derived from multiple pages or any substantial portion of this website's content, regardless of the intended purpose. This restriction includes, but is not limited to, the use of such datasets for academic research, commercial purposes, machine learning training, data analysis, or any other activity that involves the systematic extraction or aggregation of this website's content. Any use of this website or its content for research or other purposes requires prior written consent from Drugs.com. Unauthorized use or failure to obtain such consent may result in the immediate suspension or termination of Your access to the website and its services. Additionally, Drugs.com reserves the right to pursue legal action, including but not limited to seeking damages, injunctive relief, and any other remedies available under applicable law. This prohibition does not apply to automated activities conducted by legitimate search engines, including but not limited to Google, Bing, Yahoo, DuckDuckGo, MSN, and AOL, solely for the purpose of indexing and making the website's content searchable on the internet, provided such activities comply with the website's robots.txt file and do not interfere with the website's normal operations. 4. Editing, Deleting and Modification We reserve the right in our sole discretion to edit or delete any documents, information or other content appearing on the Site at any time without notice. 5. Submissions If you submit any creative suggestions, ideas, notes, drawings, concepts, reviews, questions, answers, or other content (collectively referred to as \"Submissions\"), such Submissions will be considered the sole property of Drugs.com and will remain so. None of the Submissions shall be subject to any obligation of confidence on the part of Drugs.com, and Drugs.com shall not be liable for any use or disclosure of any Submissions. You hereby represent and warrant that You have all necessary rights in and to the Submissions You provide and that all information they contain shall not infringe any proprietary or other rights of third parties, or contain any libelous, tortuous, or otherwise unlawful information. In addition, You warrant that all so-called moral rights in any Submissions You provide have been waived. Without limitation of the foregoing, Drugs.com shall exclusively own all known or hereafter existing rights to the Submissions and shall be entitled to unrestricted use of the Submissions for any purpose whatsoever, commercial or otherwise, without compensation to the provider of the Submissions. Drugs.com does not endorse and has no control over the content of Submissions submitted by others to the Site. Submissions submitted to the Site are not necessarily reviewed by Drugs.com prior to posting and do not necessarily reflect the opinions or policies of Drugs.com. Drugs.com makes no warranties, express or implied, as to the content of the Submissions on the Site or the accuracy and reliability of any Submissions and other materials on the Site. Nonetheless, Drugs.com reserves the right to prevent You from contributing Submissions to the Site and to edit, change and/or remove such Submissions for any reason whatsoever without prior notice. In the event You request the removal or modification of content submitted by You or another User which includes Personally Identifiable Information (PII), we will remove any such information upon request submitted through our contact form. 6. Indemnification You agreed to defend, indemnify and hold harmless Drugs.com, its affiliates and their respective directors, officers, employees and agents (collectively, \"Affiliated Parties\") from and against any and all claims, actions, suits or proceedings, as well as any and all losses, liabilities, damages, costs and expenses (including reasonable attorneys fees and costs) arising out of or accruing from: (a) any material posted or otherwise provided by You that infringes any copyright, trademark, trade secret, trade dress, patent or other intellectual property right of any person or defames any person or violates their rights of publicity or privacy; (b) any misrepresentation made by You in connection with Your use of the Site; (c) any non-compliance by You with the terms and conditions of this Agreement; and (d) claims regarding any liability, loss, claim and/or expense arising from or related to Your access and use of the Site, including information obtained through the Site. Notwithstanding the foregoing, Drugs.com reserves the right to assume at its expense the exclusive defense and control of any matter subject to indemnification by You, in which event You will fully cooperate with Drugs.com in asserting any available defenses. 7. Nontransferable Your right to use the Site is not transferable. Any password or right given to You to obtain information or documents is not transferable. 8. Minor You are not permitted to use our Service, under any circumstances if You are a minor. 9. Third-Party Advertisers We allow third-party advertisers (\"Advertisers\") from which You may purchase certain goods or services. You understand that we do not operate or control the products or services offered by the Advertisers. Advertisers are responsible for all aspects of order processing, fulfillment, billing and customer service. We are not a party to the transactions entered into between You and any Advertisers. YOU AGREE THAT USE OF SUCH ADVERTISERS IS AT YOUR SOLE RISK AND IS WITHOUT WARRANTIES OF ANY KIND BY US, EXPRESS, IMPLIED OR OTHERWISE INCLUDING WARRANTIES OF TITLE, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY OR NONINFRINGEMENT. UNDER NO CIRCUMSTANCES SHALL WE BE LIABLE FOR ANY DAMAGES (DIRECT OR INDIRECT) ARISING FROM ANY TRANSACTIONS BETWEEN YOU AND THE ADVERTISERS OR FOR ANY INFORMATION APPEARING ON ADVERTISER SITES OR ANY OTHER SITE LINKED TO OUR SITE. The inclusion of third-party advertisements on the Site does not imply any recommendation, approval, or endorsement by Drugs.com of the quality of the goods/services being advertised or any other characteristics or qualities of the merchant or its goods/services. You expressly agree not to rely on any claims made on this Site regarding the quality of the goods/services being advertised. To the extent desired, You shall perform all reasonable inquiries into the quality, sufficiency, legality, fitness, and ability of the Advertiser goods/services to meet Your needs. Each Advertiser has no power to bind Drugs.com in any way, including but not limited to issues regarding warranties, adequacy of goods, and all other concerns. 10. Third-Party Merchant Policies All rules, policies (including privacy policies) and operating procedures of Advertisers will apply to You while on such sites. We are not responsible for information provided by You to Advertisers. We and the Advertisers are independent contractors and neither party has authority to make any representations or commitments on behalf of the other. 11. Payments You represent and warrant that if You are purchasing something from us or from Advertisers that: (i) any credit information You supply is true and complete; (ii) charges incurred by You will be honored by Your credit card company; and (iii) You will pay the charges incurred by You at the posted prices, including any applicable taxes. 12. Securities Laws This Site may include statements concerning our operations, prospects, strategies, financial condition, future economic performance and demand for our products or services, as well as our intentions, plans and objectives, that are forward-looking statements. These statements are based upon a number of assumptions and estimates that are subject to significant uncertainties, many of which are beyond our control. When used on our Site, words like \"anticipates,\" \"expects,\" \"believes,\" \"estimates,\" \"seeks,\" \"plans,\" \"intends\" and similar expressions are intended to identify forward-looking statements designed to fall within securities law safe harbors for forward-looking statements. The Site and the information contained herein do not constitute an offer or a solicitation of an offer for the sale of any securities. None of the information contained herein is intended to be, nor shall be deemed incorporated into any of our securities-related filings or documents. 13. Links to Other Websites The Site contains links to other websites. We are not responsible for the content, accuracy or opinions expressed in such websites, and such websites are not investigated, monitored or checked for accuracy or completeness by us. Inclusion of any linked website on our Site does not imply approval or endorsement of the linked website by us. If You decide to leave our Site and access these third-party sites, You do so at Your own risk. 14. Infringement Policy Drugs.com, pursuant to 17 U.S.C. Section 512 as amended by Title II of the Digital Millennium Copyright Act (the \"Act\"), reserves the right, but not the obligation, to terminate Your license to use the Site if it determines in its sole and absolute discretion that You are involved in infringing activity, including alleged acts of first-time or repeat infringement, regardless of whether the material or activity is ultimately determined to be infringing. Drugs.com accommodates and does not interfere with standard technical measures used by copyright owners to protect their materials. In addition, pursuant to 17 U.S.C. Section 512 (c), Drugs.com has implemented procedures for receiving written notification of claimed infringements and for processing such claims in accordance with the Act. Our designated agent to receive notification of claimed infringement is: By Phone: +1 866 791 1466By e-mail: Use our contact form. In addition, any written notice regarding any defamatory or infringing activity, whether of a copyright, patent, trademark or other proprietary right, should be sent to our designated agent, listed above, and must include the following information: A. A physical or electronic signature of a person authorized to act on behalf of (1) the owner of an exclusive right that is allegedly infringed or (2) the person defamed. B. Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at the site. Similarly for other types of infringing materials, a list of such materials. C. Identification of the material that is claimed to be infringing, to be the subject of infringing activity, or that is claimed to be defamatory and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material. D. Information reasonably sufficient to permit us to contact You, such as Your address, telephone number, and/or electronic mail address. E. A statement that You have a good faith belief that use of the material in the manner complained of is not authorized by the copyright or other proprietary right owner, its agent, or the law. F. A statement that the information in the notification is accurate, and under penalty of perjury, that You are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed or on behalf of the person defamed. 15. Child Online Protection Act Notification Pursuant to 47 U.S.C. Section 230 (d) as amended, we hereby notify You that parental control protections (such as computer hardware, software, or filtering services) are commercially available that may assist You in limiting access to material that is harmful to minors. 16. Information and Press Releases The Site may contain information and press releases about us. While this information was believed to be accurate as of the date prepared, we disclaim any duty or obligation to update this information or any press releases. Information about companies other than ours contained in press releases or otherwise, should not be relied upon as being provided or endorsed by us. 17. Export Control and other International Information Unless otherwise specified, the materials on this Site are presented solely to provide information regarding and to promote Drugs.com's Site and other products available in the United States, its territories, possessions and protectorates. Drugs.com makes no representation that materials on this Site are appropriate or available for use outside the United States. Those who choose to access this Site from outside the United States do so on their own initiative and are responsible for compliance with local laws, if and to the extent that local laws are applicable. Software from this Site is further subject to United States and international export controls. No software from this Site may be downloaded or otherwise exported or re-exported (A) into (or to a national or resident of) Cuba, Iraq, Libya, North Korea, Iran, Syria, or any other country to which the U.S. has embargoed goods, or (B) to anyone on the U.S. Treasury Department's list of Specially Designated Nationals or the U.S. Commerce Department's Table of Deny Orders or to any other prohibited parties. By using the Site, You represent and warrant that You are not located in, under the control of, or a national or resident of any such country or on any such list. Information Drugs.com publishes on the World Wide Web may contain references or cross references to Drugs.com products, programs or services that are not announced or available in Your country. 18. Miscellaneous All disputes between You and Drugs.com arising in connection with this Agreement shall be finally settled by binding arbitration administered by the American Arbitration Association under its Commercial Arbitration Rules, using the Expedited Procedures, and judgment on the award rendered by the arbitrator(s) may be entered in any court of competent jurisdiction. The arbitrator shall be an individual generally skilled in the legal and business aspects of the subject matter of this Agreement. The arbitrator shall have no authority to impose penalties or award punitive damages. The arbitration shall take place in New Zealand, and the arbitrator shall apply the law of New Zealand and applicable rules of evidence. If all parties and the arbitrator agree, arbitration may take place by telephone or by written communication. Unless the arbitrator otherwise directs, the parties, their representatives, other participants, and the arbitrator shall hold the existence, content, and result of the arbitration in confidence. No action, regardless of form, related to the obligations of the parties under this Agreement may be brought by either party against the other more than one (1) year after the cause of action has accrued. In any proceeding to enforce this Agreement, the prevailing party will have the right, in addition to its other rights hereunder, to recover its reasonable litigation costs and reasonable attorneys' fees. Notwithstanding the foregoing, Drugs.com may seek immediate injunctive relief in the event of Your infringement of intellectual property rights hereunder or a breach of Your confidentiality obligations. To the extent that anything in or associated with the Site is in conflict or inconsistent with this Agreement, this Agreement shall take precedence. Our failure to enforce any provision of this Agreement shall not be deemed either a waiver of such provision or a waiver of the right to enforce such provision. Content posted by you on Drugs.com is the property of Drugs.com and will not be removed if or when you elect to close your account. However, Drugs.com will endeavor to anonymize any content posted by you immediately upon account closure. 19. Disclaimer and Limits Information on this Site may contain technical inaccuracies or typographical errors. Information may be changed or updated without notice. Drugs.com may also make improvements and/or changes in the products and/or services described in this information at any time without notice. Medical DisclaimersThis site is designed to offer You information for general educational purposes only. The health information furnished on this site and the interactive responses are not intended to be professional advice and are not intended to replace personal consultation with a qualified physician, pharmacist, or other healthcare professional. You must always seek the advice of a professional for questions related to a disease, disease symptoms, and appropriate therapeutic treatments. If You have or suspect that You have a medical problem or condition, please contact a qualified healthcare provider immediately. You should never disregard medical advice or delay in seeking it because of something You have read on this site.We do not make any warranty that the content on this site satisfies government regulations requiring disclosure of information on prescription drug products. The content was developed for use in the United States and neither we nor the content providers make any representation concerning the content when used in any other country. While information on this site has been obtained from sources believed to be reliable, neither we nor the content providers warrant the accuracy of codes, prices, therapeutic content, or other data of any nature contained on this website. We do not give medical advice, nor do we provide medical or diagnostic services. Neither we nor the content providers guarantee that the content on this website covers all possible uses, directions, precautions, drug interactions, or adverse effects that may be associated with any therapeutic treatment. You may not rely on the application of any information on this website as being applicable to Your specific circumstances. Your reliance upon information and content obtained by You at or through this site is solely at Your own risk. Neither we nor the content providers assume any liability or responsibility for damage or injury (including death) to You, other persons, or property arising from any use of any information, idea, or instruction contained in the content or services provided to You. Liability DisclaimersDrugs.com and the content providers have utilized reasonable care in collecting and reporting the information on this website and have obtained such information from sources believed to be reliable. However, Drugs.com and the content providers do not warrant the accuracy of the information on the website. Information reflecting prices is not a quotation or offer to sell or purchase. The clinical information contained in the information is intended as a supplement to, and not a substitute for, the knowledge, expertise, skill, and judgment of physicians, pharmacists, nurses, or other healthcare professionals involved in patient care. The absence of a warning for a given drug or drug combination should not be construed to indicate that the drug or drug combination is safe, appropriate, or effective in any given patient or under Your particular circumstances. THE INFORMATION FROM OR THROUGH THE SITE IS PROVIDED \"AS IS,\" \"AS AVAILABLE,\" AND DRUGS.COM AND THE CONTENT PROVIDERS MAKE NO WARRANTY OR REPRESENTATION, EXPRESS OR IMPLIED, AS TO THE ACCURACY OF THE DATA FROM WHICH THE INFORMATION IS COMPILED OR THE ACCURACY OF THE INFORMATION ITSELF AND SPECIFICALLY DISCLAIMS THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE INFORMATION AND SERVICES MAY CONTAIN BUGS, ERRORS, PROBLEMS OR OTHER LIMITATIONS. DRUGS.COM AND ITS AFFILIATED PARTIES HAVE NO LIABILITY WHATSOEVER FOR YOUR USE OF ANY INFORMATION OR SERVICE. WE ARE NOT LIABLE FOR ANY FAILURE TO PERFORM OR PERFORMANCE DUE TO A FORCE MAJEURE EVENT. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM US THROUGH THE SITE SHALL CREATE ANY WARRANTY, REPRESENTATION OR GUARANTEE NOT EXPRESSLY STATED IN THIS AGREEMENT. THIS WEBSITE AND THE CONTENT PROVIDERS OFFER NO MEDICAL ADVICE IN CONNECTION WITH THIS WEBSITE. USERS ARE RESPONSIBLE FOR THE USE OF THE CONTENT ON THIS WEBSITE. A LICENSED MEDICAL PROFESSIONAL IS RESPONSIBLE FOR INDEPENDENTLY REACHING ANY MEDICAL JUDGMENT, AND FOR ANY RESULTING DIAGNOSIS AND TREATMENTS, NOTWITHSTANDING ANY USE OF THE CONTENT BY SUCH MEDICAL PROFESSIONAL. BY USE OF THIS WEBSITE YOU ACKNOWLEDGE AND AGREE THAT THE INFORMATION ON THIS WEBSITE MAY CONTAIN INACCURACIES AND OTHER ERRORS. YOU USE THIS WEBSITE AND THE MATERIAL AND INFORMATION ON THE WEBSITE AT YOUR OWN RISK. DRUGS.COM AND THE CONTENT PROVIDERS ARE NOT LIABLE FOR ANY DAMAGES ALLEGEDLY SUSTAINED ARISING OUT OF USE OF THE WEB SITE, AND INCLUDING ANY CONSEQUENTIAL, SPECIAL, OR SIMILAR DAMAGES, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ALL RESPONSIBILITY OR LIABILITY FOR ANY DAMAGES CAUSED BY VIRUSES, WORMS OR OTHER MALICIOUS SOFTWARE CONTAINED WITHIN THE SITE IS DISCLAIMED. WE WILL NOT BE LIABLE TO YOU FOR ANY INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OF ANY KIND (INCLUDING LOST PROFITS) THAT MAY RESULT FROM USE OF, OR INABILITY TO USE OUR SITE. DRUGS.COM DOES NOT WARRANT OR MAKE REPRESENTATION REGARDING THE USE OR THE RESULTS OF THE USE OF THE MATERIALS IN THIS SITE IN TERMS OF THEIR CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE. AS A LIMITATION THEREOF, WE AND OUR AFFILIATED PARTIES ARE NOT LIABLE FOR ANY INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES FOR LOSS OF BUSINESS, LOSS OF PROFITS, LITIGATION, OR THE LIKE), WHETHER BASED ON BREACH OF CONTRACT, BREACH OF WARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE NEGATION OF DAMAGES SET FORTH ABOVE IS A FUNDAMENTAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN US AND YOU. THIS SITE AND THE INFORMATION WOULD NOT BE PROVIDED WITHOUT SUCH LIMITATIONS. IF, NOTWITHSTANDING THE OTHER TERMS OF THIS AGREEMENT (OR ANY OTHER AGREEMENT BETWEEN YOU AND US), WE (OR THE CONTENT PROVIDERS OR SPONSOR/ADVERTISERS) SHOULD HAVE ANY LIABILITY FOR ANY LOSS, HARM OR DAMAGE, YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT SUCH LIABILITY SHALL UNDER NO CIRCUMSTANCES EXCEED $1,000. YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT THE FOREGOING LIMITATION OF LIABILITY IS AN AGREED ALLOCATION OF RISK BETWEEN YOU AND US (AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AND REFLECTS THE FEES, IF ANY, WE CHARGE YOU TO USE THIS SITE, THE SERVICES AND THE CONTENT. YOU ACKNOWLEDGE THAT ABSENT YOUR AGREEMENT TO THIS LIMITATION OF LIABILITY WE WOULD NOT PROVIDE THE WEBSITE, THE SERVICES, OR THE CONTENT TO YOU.", "mechanism": null, "dosage": null, "side_effects": "Prohibited Uses: Data Scraping and Dataset Creation You are expressly prohibited from engaging in any activity that involves the automated downloading, scraping, or extraction of content from this website, including but not limited to the use of bots, scripts, or other automated tools or technologies. This prohibition applies to the collection, storage, or creation of datasets derived from multiple pages or any substantial portion of this website's content, regardless of the intended purpose. This restriction includes, but is not limited to, the use of such datasets for academic research, commercial purposes, machine learning training, data analysis, or any other activity that involves the systematic extraction or aggregation of this website's content. Any use of this website or its content for research or other purposes requires prior written consent from Drugs.com. Unauthorized use or failure to obtain such consent may result in the immediate suspension or termination of Your access to the website and its services. Additionally, Drugs.com reserves the right to pursue legal action, including but not limited to seeking damages, injunctive relief, and any other remedies available under applicable law. This prohibition does not apply to automated activities conducted by legitimate search engines, including but not limited to Google, Bing, Yahoo, DuckDuckGo, MSN, and AOL, solely for the purpose of indexing and making the website's content searchable on the internet, provided such activities comply with the website's robots.txt file and do not interfere with the website's normal operations. 4. Editing, Deleting and Modification We reserve the right in our sole discretion to edit or delete any documents, information or other content appearing on the Site at any time without notice. 5. Submissions If you submit any creative suggestions, ideas, notes, drawings, concepts, reviews, questions, answers, or other content (collectively referred to as \"Submissions\"), such Submissions will be considered the sole property of Drugs.com and will remain so. None of the Submissions shall be subject to any obligation of confidence on the part of Drugs.com, and Drugs.com shall not be liable for any use or disclosure of any Submissions. You hereby represent and warrant that You have all necessary rights in and to the Submissions You provide and that all information they contain shall not infringe any proprietary or other rights of third parties, or contain any libelous, tortuous, or otherwise unlawful information. In addition, You warrant that all so-called moral rights in any Submissions You provide have been waived. Without limitation of the foregoing, Drugs.com shall exclusively own all known or hereafter existing rights to the Submissions and shall be entitled to unrestricted use of the Submissions for any purpose whatsoever, commercial or otherwise, without compensation to the provider of the Submissions. Drugs.com does not endorse and has no control over the content of Submissions submitted by others to the Site. Submissions submitted to the Site are not necessarily reviewed by Drugs.com prior to posting and do not necessarily reflect the opinions or policies of Drugs.com. Drugs.com makes no warranties, express or implied, as to the content of the Submissions on the Site or the accuracy and reliability of any Submissions and other materials on the Site. Nonetheless, Drugs.com reserves the right to prevent You from contributing Submissions to the Site and to edit, change and/or remove such Submissions for any reason whatsoever without prior notice. In the event You request the removal or modification of content submitted by You or another User which includes Personally Identifiable Information (PII), we will remove any such information upon request submitted through our contact form. 6. Indemnification You agreed to defend, indemnify and hold harmless Drugs.com, its affiliates and their respective directors, officers, employees and agents (collectively, \"Affiliated Parties\") from and against any and all claims, actions, suits or proceedings, as well as any and all losses, liabilities, damages, costs and expenses (including reasonable attorneys fees and costs) arising out of or accruing from: (a) any material posted or otherwise provided by You that infringes any copyright, trademark, trade secret, trade dress, patent or other intellectual property right of any person or defames any person or violates their rights of publicity or privacy; (b) any misrepresentation made by You in connection with Your use of the Site; (c) any non-compliance by You with the terms and conditions of this Agreement; and (d) claims regarding any liability, loss, claim and/or expense arising from or related to Your access and use of the Site, including information obtained through the Site. Notwithstanding the foregoing, Drugs.com reserves the right to assume at its expense the exclusive defense and control of any matter subject to indemnification by You, in which event You will fully cooperate with Drugs.com in asserting any available defenses. 7. Nontransferable Your right to use the Site is not transferable. Any password or right given to You to obtain information or documents is not transferable. 8. Minor You are not permitted to use our Service, under any circumstances if You are a minor. 9. Third-Party Advertisers We allow third-party advertisers (\"Advertisers\") from which You may purchase certain goods or services. You understand that we do not operate or control the products or services offered by the Advertisers. Advertisers are responsible for all aspects of order processing, fulfillment, billing and customer service. We are not a party to the transactions entered into between You and any Advertisers. YOU AGREE THAT USE OF SUCH ADVERTISERS IS AT YOUR SOLE RISK AND IS WITHOUT WARRANTIES OF ANY KIND BY US, EXPRESS, IMPLIED OR OTHERWISE INCLUDING WARRANTIES OF TITLE, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY OR NONINFRINGEMENT. UNDER NO CIRCUMSTANCES SHALL WE BE LIABLE FOR ANY DAMAGES (DIRECT OR INDIRECT) ARISING FROM ANY TRANSACTIONS BETWEEN YOU AND THE ADVERTISERS OR FOR ANY INFORMATION APPEARING ON ADVERTISER SITES OR ANY OTHER SITE LINKED TO OUR SITE. The inclusion of third-party advertisements on the Site does not imply any recommendation, approval, or endorsement by Drugs.com of the quality of the goods/services being advertised or any other characteristics or qualities of the merchant or its goods/services. You expressly agree not to rely on any claims made on this Site regarding the quality of the goods/services being advertised. To the extent desired, You shall perform all reasonable inquiries into the quality, sufficiency, legality, fitness, and ability of the Advertiser goods/services to meet Your needs. Each Advertiser has no power to bind Drugs.com in any way, including but not limited to issues regarding warranties, adequacy of goods, and all other concerns. 10. Third-Party Merchant Policies All rules, policies (including privacy policies) and operating procedures of Advertisers will apply to You while on such sites. We are not responsible for information provided by You to Advertisers. We and the Advertisers are independent contractors and neither party has authority to make any representations or commitments on behalf of the other. 11. Payments You represent and warrant that if You are purchasing something from us or from Advertisers that: (i) any credit information You supply is true and complete; (ii) charges incurred by You will be honored by Your credit card company; and (iii) You will pay the charges incurred by You at the posted prices, including any applicable taxes. 12. Securities Laws This Site may include statements concerning our operations, prospects, strategies, financial condition, future economic performance and demand for our products or services, as well as our intentions, plans and objectives, that are forward-looking statements. These statements are based upon a number of assumptions and estimates that are subject to significant uncertainties, many of which are beyond our control. When used on our Site, words like \"anticipates,\" \"expects,\" \"believes,\" \"estimates,\" \"seeks,\" \"plans,\" \"intends\" and similar expressions are intended to identify forward-looking statements designed to fall within securities law safe harbors for forward-looking statements. The Site and the information contained herein do not constitute an offer or a solicitation of an offer for the sale of any securities. None of the information contained herein is intended to be, nor shall be deemed incorporated into any of our securities-related filings or documents. 13. Links to Other Websites The Site contains links to other websites. We are not responsible for the content, accuracy or opinions expressed in such websites, and such websites are not investigated, monitored or checked for accuracy or completeness by us. Inclusion of any linked website on our Site does not imply approval or endorsement of the linked website by us. If You decide to leave our Site and access these third-party sites, You do so at Your own risk. 14. Infringement Policy Drugs.com, pursuant to 17 U.S.C. Section 512 as amended by Title II of the Digital Millennium Copyright Act (the \"Act\"), reserves the right, but not the obligation, to terminate Your license to use the Site if it determines in its sole and absolute discretion that You are involved in infringing activity, including alleged acts of first-time or repeat infringement, regardless of whether the material or activity is ultimately determined to be infringing. Drugs.com accommodates and does not interfere with standard technical measures used by copyright owners to protect their materials. In addition, pursuant to 17 U.S.C. Section 512 (c), Drugs.com has implemented procedures for receiving written notification of claimed infringements and for processing such claims in accordance with the Act. Our designated agent to receive notification of claimed infringement is: By Phone: +1 866 791 1466By e-mail: Use our contact form. In addition, any written notice regarding any defamatory or infringing activity, whether of a copyright, patent, trademark or other proprietary right, should be sent to our designated agent, listed above, and must include the following information: A. A physical or electronic signature of a person authorized to act on behalf of (1) the owner of an exclusive right that is allegedly infringed or (2) the person defamed. B. Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at the site. Similarly for other types of infringing materials, a list of such materials. C. Identification of the material that is claimed to be infringing, to be the subject of infringing activity, or that is claimed to be defamatory and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material. D. Information reasonably sufficient to permit us to contact You, such as Your address, telephone number, and/or electronic mail address. E. A statement that You have a good faith belief that use of the material in the manner complained of is not authorized by the copyright or other proprietary right owner, its agent, or the law. F. A statement that the information in the notification is accurate, and under penalty of perjury, that You are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed or on behalf of the person defamed. 15. Child Online Protection Act Notification Pursuant to 47 U.S.C. Section 230 (d) as amended, we hereby notify You that parental control protections (such as computer hardware, software, or filtering services) are commercially available that may assist You in limiting access to material that is harmful to minors. 16. Information and Press Releases The Site may contain information and press releases about us. While this information was believed to be accurate as of the date prepared, we disclaim any duty or obligation to update this information or any press releases. Information about companies other than ours contained in press releases or otherwise, should not be relied upon as being provided or endorsed by us. 17. Export Control and other International Information Unless otherwise specified, the materials on this Site are presented solely to provide information regarding and to promote Drugs.com's Site and other products available in the United States, its territories, possessions and protectorates. Drugs.com makes no representation that materials on this Site are appropriate or available for use outside the United States. Those who choose to access this Site from outside the United States do so on their own initiative and are responsible for compliance with local laws, if and to the extent that local laws are applicable. Software from this Site is further subject to United States and international export controls. No software from this Site may be downloaded or otherwise exported or re-exported (A) into (or to a national or resident of) Cuba, Iraq, Libya, North Korea, Iran, Syria, or any other country to which the U.S. has embargoed goods, or (B) to anyone on the U.S. Treasury Department's list of Specially Designated Nationals or the U.S. Commerce Department's Table of Deny Orders or to any other prohibited parties. By using the Site, You represent and warrant that You are not located in, under the control of, or a national or resident of any such country or on any such list. Information Drugs.com publishes on the World Wide Web may contain references or cross references to Drugs.com products, programs or services that are not announced or available in Your country. 18. Miscellaneous All disputes between You and Drugs.com arising in connection with this Agreement shall be finally settled by binding arbitration administered by the American Arbitration Association under its Commercial Arbitration Rules, using the Expedited Procedures, and judgment on the award rendered by the arbitrator(s) may be entered in any court of competent jurisdiction. The arbitrator shall be an individual generally skilled in the legal and business aspects of the subject matter of this Agreement. The arbitrator shall have no authority to impose penalties or award punitive damages. The arbitration shall take place in New Zealand, and the arbitrator shall apply the law of New Zealand and applicable rules of evidence. If all parties and the arbitrator agree, arbitration may take place by telephone or by written communication. Unless the arbitrator otherwise directs, the parties, their representatives, other participants, and the arbitrator shall hold the existence, content, and result of the arbitration in confidence. No action, regardless of form, related to the obligations of the parties under this Agreement may be brought by either party against the other more than one (1) year after the cause of action has accrued. In any proceeding to enforce this Agreement, the prevailing party will have the right, in addition to its other rights hereunder, to recover its reasonable litigation costs and reasonable attorneys' fees. Notwithstanding the foregoing, Drugs.com may seek immediate injunctive relief in the event of Your infringement of intellectual property rights hereunder or a breach of Your confidentiality obligations. To the extent that anything in or associated with the Site is in conflict or inconsistent with this Agreement, this Agreement shall take precedence. Our failure to enforce any provision of this Agreement shall not be deemed either a waiver of such provision or a waiver of the right to enforce such provision. Content posted by you on Drugs.com is the property of Drugs.com and will not be removed if or when you elect to close your account. However, Drugs.com will endeavor to anonymize any content posted by you immediately upon account closure. 19. Disclaimer and Limits Information on this Site may contain technical inaccuracies or typographical errors. Information may be changed or updated without notice. Drugs.com may also make improvements and/or changes in the products and/or services described in this information at any time without notice. Medical DisclaimersThis site is designed to offer You information for general educational purposes only. The health information furnished on this site and the interactive responses are not intended to be professional advice and are not intended to replace personal consultation with a qualified physician, pharmacist, or other healthcare professional. You must always seek the advice of a professional for questions related to a disease, disease symptoms, and appropriate therapeutic treatments. If You have or suspect that You have a medical problem or condition, please contact a qualified healthcare provider immediately. You should never disregard medical advice or delay in seeking it because of something You have read on this site.We do not make any warranty that the content on this site satisfies government regulations requiring disclosure of information on prescription drug products. The content was developed for use in the United States and neither we nor the content providers make any representation concerning the content when used in any other country. While information on this site has been obtained from sources believed to be reliable, neither we nor the content providers warrant the accuracy of codes, prices, therapeutic content, or other data of any nature contained on this website. We do not give medical advice, nor do we provide medical or diagnostic services. Neither we nor the content providers guarantee that the content on this website covers all possible uses, directions, precautions, drug interactions, or adverse effects that may be associated with any therapeutic treatment. You may not rely on the application of any information on this website as being applicable to Your specific circumstances. Your reliance upon information and content obtained by You at or through this site is solely at Your own risk. Neither we nor the content providers assume any liability or responsibility for damage or injury (including death) to You, other persons, or property arising from any use of any information, idea, or instruction contained in the content or services provided to You. Liability DisclaimersDrugs.com and the content providers have utilized reasonable care in collecting and reporting the information on this website and have obtained such information from sources believed to be reliable. However, Drugs.com and the content providers do not warrant the accuracy of the information on the website. Information reflecting prices is not a quotation or offer to sell or purchase. The clinical information contained in the information is intended as a supplement to, and not a substitute for, the knowledge, expertise, skill, and judgment of physicians, pharmacists, nurses, or other healthcare professionals involved in patient care. The absence of a warning for a given drug or drug combination should not be construed to indicate that the drug or drug combination is safe, appropriate, or effective in any given patient or under Your particular circumstances. THE INFORMATION FROM OR THROUGH THE SITE IS PROVIDED \"AS IS,\" \"AS AVAILABLE,\" AND DRUGS.COM AND THE CONTENT PROVIDERS MAKE NO WARRANTY OR REPRESENTATION, EXPRESS OR IMPLIED, AS TO THE ACCURACY OF THE DATA FROM WHICH THE INFORMATION IS COMPILED OR THE ACCURACY OF THE INFORMATION ITSELF AND SPECIFICALLY DISCLAIMS THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE INFORMATION AND SERVICES MAY CONTAIN BUGS, ERRORS, PROBLEMS OR OTHER LIMITATIONS. DRUGS.COM AND ITS AFFILIATED PARTIES HAVE NO LIABILITY WHATSOEVER FOR YOUR USE OF ANY INFORMATION OR SERVICE. WE ARE NOT LIABLE FOR ANY FAILURE TO PERFORM OR PERFORMANCE DUE TO A FORCE MAJEURE EVENT. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM US THROUGH THE SITE SHALL CREATE ANY WARRANTY, REPRESENTATION OR GUARANTEE NOT EXPRESSLY STATED IN THIS AGREEMENT. THIS WEBSITE AND THE CONTENT PROVIDERS OFFER NO MEDICAL ADVICE IN CONNECTION WITH THIS WEBSITE. USERS ARE RESPONSIBLE FOR THE USE OF THE CONTENT ON THIS WEBSITE. A LICENSED MEDICAL PROFESSIONAL IS RESPONSIBLE FOR INDEPENDENTLY REACHING ANY MEDICAL JUDGMENT, AND FOR ANY RESULTING DIAGNOSIS AND TREATMENTS, NOTWITHSTANDING ANY USE OF THE CONTENT BY SUCH MEDICAL PROFESSIONAL. BY USE OF THIS WEBSITE YOU ACKNOWLEDGE AND AGREE THAT THE INFORMATION ON THIS WEBSITE MAY CONTAIN INACCURACIES AND OTHER ERRORS. YOU USE THIS WEBSITE AND THE MATERIAL AND INFORMATION ON THE WEBSITE AT YOUR OWN RISK. DRUGS.COM AND THE CONTENT PROVIDERS ARE NOT LIABLE FOR ANY DAMAGES ALLEGEDLY SUSTAINED ARISING OUT OF USE OF THE WEB SITE, AND INCLUDING ANY CONSEQUENTIAL, SPECIAL, OR SIMILAR DAMAGES, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ALL RESPONSIBILITY OR LIABILITY FOR ANY DAMAGES CAUSED BY VIRUSES, WORMS OR OTHER MALICIOUS SOFTWARE CONTAINED WITHIN THE SITE IS DISCLAIMED. WE WILL NOT BE LIABLE TO YOU FOR ANY INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OF ANY KIND (INCLUDING LOST PROFITS) THAT MAY RESULT FROM USE OF, OR INABILITY TO USE OUR SITE. DRUGS.COM DOES NOT WARRANT OR MAKE REPRESENTATION REGARDING THE USE OR THE RESULTS OF THE USE OF THE MATERIALS IN THIS SITE IN TERMS OF THEIR CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE. AS A LIMITATION THEREOF, WE AND OUR AFFILIATED PARTIES ARE NOT LIABLE FOR ANY INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES FOR LOSS OF BUSINESS, LOSS OF PROFITS, LITIGATION, OR THE LIKE), WHETHER BASED ON BREACH OF CONTRACT, BREACH OF WARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE NEGATION OF DAMAGES SET FORTH ABOVE IS A FUNDAMENTAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN US AND YOU. THIS SITE AND THE INFORMATION WOULD NOT BE PROVIDED WITHOUT SUCH LIMITATIONS. IF, NOTWITHSTANDING THE OTHER TERMS OF THIS AGREEMENT (OR ANY OTHER AGREEMENT BETWEEN YOU AND US), WE (OR THE CONTENT PROVIDERS OR SPONSOR/ADVERTISERS) SHOULD HAVE ANY LIABILITY FOR ANY LOSS, HARM OR DAMAGE, YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT SUCH LIABILITY SHALL UNDER NO CIRCUMSTANCES EXCEED $1,000. YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT THE FOREGOING LIMITATION OF LIABILITY IS AN AGREED ALLOCATION OF RISK BETWEEN YOU AND US (AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AND REFLECTS THE FEES, IF ANY, WE CHARGE YOU TO USE THIS SITE, THE SERVICES AND THE CONTENT. YOU ACKNOWLEDGE THAT ABSENT YOUR AGREEMENT TO THIS LIMITATION OF LIABILITY WE WOULD NOT PROVIDE THE WEBSITE, THE SERVICES, OR THE CONTENT TO YOU.", "interactions": "Prohibited Uses: Data Scraping and Dataset Creation You are expressly prohibited from engaging in any activity that involves the automated downloading, scraping, or extraction of content from this website, including but not limited to the use of bots, scripts, or other automated tools or technologies. This prohibition applies to the collection, storage, or creation of datasets derived from multiple pages or any substantial portion of this website's content, regardless of the intended purpose. This restriction includes, but is not limited to, the use of such datasets for academic research, commercial purposes, machine learning training, data analysis, or any other activity that involves the systematic extraction or aggregation of this website's content. Any use of this website or its content for research or other purposes requires prior written consent from Drugs.com. Unauthorized use or failure to obtain such consent may result in the immediate suspension or termination of Your access to the website and its services. Additionally, Drugs.com reserves the right to pursue legal action, including but not limited to seeking damages, injunctive relief, and any other remedies available under applicable law. This prohibition does not apply to automated activities conducted by legitimate search engines, including but not limited to Google, Bing, Yahoo, DuckDuckGo, MSN, and AOL, solely for the purpose of indexing and making the website's content searchable on the internet, provided such activities comply with the website's robots.txt file and do not interfere with the website's normal operations. 4. Editing, Deleting and Modification We reserve the right in our sole discretion to edit or delete any documents, information or other content appearing on the Site at any time without notice. 5. Submissions If you submit any creative suggestions, ideas, notes, drawings, concepts, reviews, questions, answers, or other content (collectively referred to as \"Submissions\"), such Submissions will be considered the sole property of Drugs.com and will remain so. None of the Submissions shall be subject to any obligation of confidence on the part of Drugs.com, and Drugs.com shall not be liable for any use or disclosure of any Submissions. You hereby represent and warrant that You have all necessary rights in and to the Submissions You provide and that all information they contain shall not infringe any proprietary or other rights of third parties, or contain any libelous, tortuous, or otherwise unlawful information. In addition, You warrant that all so-called moral rights in any Submissions You provide have been waived. Without limitation of the foregoing, Drugs.com shall exclusively own all known or hereafter existing rights to the Submissions and shall be entitled to unrestricted use of the Submissions for any purpose whatsoever, commercial or otherwise, without compensation to the provider of the Submissions. Drugs.com does not endorse and has no control over the content of Submissions submitted by others to the Site. Submissions submitted to the Site are not necessarily reviewed by Drugs.com prior to posting and do not necessarily reflect the opinions or policies of Drugs.com. Drugs.com makes no warranties, express or implied, as to the content of the Submissions on the Site or the accuracy and reliability of any Submissions and other materials on the Site. Nonetheless, Drugs.com reserves the right to prevent You from contributing Submissions to the Site and to edit, change and/or remove such Submissions for any reason whatsoever without prior notice. In the event You request the removal or modification of content submitted by You or another User which includes Personally Identifiable Information (PII), we will remove any such information upon request submitted through our contact form. 6. Indemnification You agreed to defend, indemnify and hold harmless Drugs.com, its affiliates and their respective directors, officers, employees and agents (collectively, \"Affiliated Parties\") from and against any and all claims, actions, suits or proceedings, as well as any and all losses, liabilities, damages, costs and expenses (including reasonable attorneys fees and costs) arising out of or accruing from: (a) any material posted or otherwise provided by You that infringes any copyright, trademark, trade secret, trade dress, patent or other intellectual property right of any person or defames any person or violates their rights of publicity or privacy; (b) any misrepresentation made by You in connection with Your use of the Site; (c) any non-compliance by You with the terms and conditions of this Agreement; and (d) claims regarding any liability, loss, claim and/or expense arising from or related to Your access and use of the Site, including information obtained through the Site. Notwithstanding the foregoing, Drugs.com reserves the right to assume at its expense the exclusive defense and control of any matter subject to indemnification by You, in which event You will fully cooperate with Drugs.com in asserting any available defenses. 7. Nontransferable Your right to use the Site is not transferable. Any password or right given to You to obtain information or documents is not transferable. 8. Minor You are not permitted to use our Service, under any circumstances if You are a minor. 9. Third-Party Advertisers We allow third-party advertisers (\"Advertisers\") from which You may purchase certain goods or services. You understand that we do not operate or control the products or services offered by the Advertisers. Advertisers are responsible for all aspects of order processing, fulfillment, billing and customer service. We are not a party to the transactions entered into between You and any Advertisers. YOU AGREE THAT USE OF SUCH ADVERTISERS IS AT YOUR SOLE RISK AND IS WITHOUT WARRANTIES OF ANY KIND BY US, EXPRESS, IMPLIED OR OTHERWISE INCLUDING WARRANTIES OF TITLE, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY OR NONINFRINGEMENT. UNDER NO CIRCUMSTANCES SHALL WE BE LIABLE FOR ANY DAMAGES (DIRECT OR INDIRECT) ARISING FROM ANY TRANSACTIONS BETWEEN YOU AND THE ADVERTISERS OR FOR ANY INFORMATION APPEARING ON ADVERTISER SITES OR ANY OTHER SITE LINKED TO OUR SITE. The inclusion of third-party advertisements on the Site does not imply any recommendation, approval, or endorsement by Drugs.com of the quality of the goods/services being advertised or any other characteristics or qualities of the merchant or its goods/services. You expressly agree not to rely on any claims made on this Site regarding the quality of the goods/services being advertised. To the extent desired, You shall perform all reasonable inquiries into the quality, sufficiency, legality, fitness, and ability of the Advertiser goods/services to meet Your needs. Each Advertiser has no power to bind Drugs.com in any way, including but not limited to issues regarding warranties, adequacy of goods, and all other concerns. 10. Third-Party Merchant Policies All rules, policies (including privacy policies) and operating procedures of Advertisers will apply to You while on such sites. We are not responsible for information provided by You to Advertisers. We and the Advertisers are independent contractors and neither party has authority to make any representations or commitments on behalf of the other. 11. Payments You represent and warrant that if You are purchasing something from us or from Advertisers that: (i) any credit information You supply is true and complete; (ii) charges incurred by You will be honored by Your credit card company; and (iii) You will pay the charges incurred by You at the posted prices, including any applicable taxes. 12. Securities Laws This Site may include statements concerning our operations, prospects, strategies, financial condition, future economic performance and demand for our products or services, as well as our intentions, plans and objectives, that are forward-looking statements. These statements are based upon a number of assumptions and estimates that are subject to significant uncertainties, many of which are beyond our control. When used on our Site, words like \"anticipates,\" \"expects,\" \"believes,\" \"estimates,\" \"seeks,\" \"plans,\" \"intends\" and similar expressions are intended to identify forward-looking statements designed to fall within securities law safe harbors for forward-looking statements. The Site and the information contained herein do not constitute an offer or a solicitation of an offer for the sale of any securities. None of the information contained herein is intended to be, nor shall be deemed incorporated into any of our securities-related filings or documents. 13. Links to Other Websites The Site contains links to other websites. We are not responsible for the content, accuracy or opinions expressed in such websites, and such websites are not investigated, monitored or checked for accuracy or completeness by us. Inclusion of any linked website on our Site does not imply approval or endorsement of the linked website by us. If You decide to leave our Site and access these third-party sites, You do so at Your own risk. 14. Infringement Policy Drugs.com, pursuant to 17 U.S.C. Section 512 as amended by Title II of the Digital Millennium Copyright Act (the \"Act\"), reserves the right, but not the obligation, to terminate Your license to use the Site if it determines in its sole and absolute discretion that You are involved in infringing activity, including alleged acts of first-time or repeat infringement, regardless of whether the material or activity is ultimately determined to be infringing. Drugs.com accommodates and does not interfere with standard technical measures used by copyright owners to protect their materials. In addition, pursuant to 17 U.S.C. Section 512 (c), Drugs.com has implemented procedures for receiving written notification of claimed infringements and for processing such claims in accordance with the Act. Our designated agent to receive notification of claimed infringement is: By Phone: +1 866 791 1466By e-mail: Use our contact form. In addition, any written notice regarding any defamatory or infringing activity, whether of a copyright, patent, trademark or other proprietary right, should be sent to our designated agent, listed above, and must include the following information: A. A physical or electronic signature of a person authorized to act on behalf of (1) the owner of an exclusive right that is allegedly infringed or (2) the person defamed. B. Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at the site. Similarly for other types of infringing materials, a list of such materials. C. Identification of the material that is claimed to be infringing, to be the subject of infringing activity, or that is claimed to be defamatory and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material. D. Information reasonably sufficient to permit us to contact You, such as Your address, telephone number, and/or electronic mail address. E. A statement that You have a good faith belief that use of the material in the manner complained of is not authorized by the copyright or other proprietary right owner, its agent, or the law. F. A statement that the information in the notification is accurate, and under penalty of perjury, that You are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed or on behalf of the person defamed. 15. Child Online Protection Act Notification Pursuant to 47 U.S.C. Section 230 (d) as amended, we hereby notify You that parental control protections (such as computer hardware, software, or filtering services) are commercially available that may assist You in limiting access to material that is harmful to minors. 16. Information and Press Releases The Site may contain information and press releases about us. While this information was believed to be accurate as of the date prepared, we disclaim any duty or obligation to update this information or any press releases. Information about companies other than ours contained in press releases or otherwise, should not be relied upon as being provided or endorsed by us. 17. Export Control and other International Information Unless otherwise specified, the materials on this Site are presented solely to provide information regarding and to promote Drugs.com's Site and other products available in the United States, its territories, possessions and protectorates. Drugs.com makes no representation that materials on this Site are appropriate or available for use outside the United States. Those who choose to access this Site from outside the United States do so on their own initiative and are responsible for compliance with local laws, if and to the extent that local laws are applicable. Software from this Site is further subject to United States and international export controls. No software from this Site may be downloaded or otherwise exported or re-exported (A) into (or to a national or resident of) Cuba, Iraq, Libya, North Korea, Iran, Syria, or any other country to which the U.S. has embargoed goods, or (B) to anyone on the U.S. Treasury Department's list of Specially Designated Nationals or the U.S. Commerce Department's Table of Deny Orders or to any other prohibited parties. By using the Site, You represent and warrant that You are not located in, under the control of, or a national or resident of any such country or on any such list. Information Drugs.com publishes on the World Wide Web may contain references or cross references to Drugs.com products, programs or services that are not announced or available in Your country. 18. Miscellaneous All disputes between You and Drugs.com arising in connection with this Agreement shall be finally settled by binding arbitration administered by the American Arbitration Association under its Commercial Arbitration Rules, using the Expedited Procedures, and judgment on the award rendered by the arbitrator(s) may be entered in any court of competent jurisdiction. The arbitrator shall be an individual generally skilled in the legal and business aspects of the subject matter of this Agreement. The arbitrator shall have no authority to impose penalties or award punitive damages. The arbitration shall take place in New Zealand, and the arbitrator shall apply the law of New Zealand and applicable rules of evidence. If all parties and the arbitrator agree, arbitration may take place by telephone or by written communication. Unless the arbitrator otherwise directs, the parties, their representatives, other participants, and the arbitrator shall hold the existence, content, and result of the arbitration in confidence. No action, regardless of form, related to the obligations of the parties under this Agreement may be brought by either party against the other more than one (1) year after the cause of action has accrued. In any proceeding to enforce this Agreement, the prevailing party will have the right, in addition to its other rights hereunder, to recover its reasonable litigation costs and reasonable attorneys' fees. Notwithstanding the foregoing, Drugs.com may seek immediate injunctive relief in the event of Your infringement of intellectual property rights hereunder or a breach of Your confidentiality obligations. To the extent that anything in or associated with the Site is in conflict or inconsistent with this Agreement, this Agreement shall take precedence. Our failure to enforce any provision of this Agreement shall not be deemed either a waiver of such provision or a waiver of the right to enforce such provision. Content posted by you on Drugs.com is the property of Drugs.com and will not be removed if or when you elect to close your account. However, Drugs.com will endeavor to anonymize any content posted by you immediately upon account closure. 19. Disclaimer and Limits Information on this Site may contain technical inaccuracies or typographical errors. Information may be changed or updated without notice. Drugs.com may also make improvements and/or changes in the products and/or services described in this information at any time without notice. Medical DisclaimersThis site is designed to offer You information for general educational purposes only. The health information furnished on this site and the interactive responses are not intended to be professional advice and are not intended to replace personal consultation with a qualified physician, pharmacist, or other healthcare professional. You must always seek the advice of a professional for questions related to a disease, disease symptoms, and appropriate therapeutic treatments. If You have or suspect that You have a medical problem or condition, please contact a qualified healthcare provider immediately. You should never disregard medical advice or delay in seeking it because of something You have read on this site.We do not make any warranty that the content on this site satisfies government regulations requiring disclosure of information on prescription drug products. The content was developed for use in the United States and neither we nor the content providers make any representation concerning the content when used in any other country. While information on this site has been obtained from sources believed to be reliable, neither we nor the content providers warrant the accuracy of codes, prices, therapeutic content, or other data of any nature contained on this website. We do not give medical advice, nor do we provide medical or diagnostic services. Neither we nor the content providers guarantee that the content on this website covers all possible uses, directions, precautions, drug interactions, or adverse effects that may be associated with any therapeutic treatment. You may not rely on the application of any information on this website as being applicable to Your specific circumstances. Your reliance upon information and content obtained by You at or through this site is solely at Your own risk. Neither we nor the content providers assume any liability or responsibility for damage or injury (including death) to You, other persons, or property arising from any use of any information, idea, or instruction contained in the content or services provided to You. Liability DisclaimersDrugs.com and the content providers have utilized reasonable care in collecting and reporting the information on this website and have obtained such information from sources believed to be reliable. However, Drugs.com and the content providers do not warrant the accuracy of the information on the website. Information reflecting prices is not a quotation or offer to sell or purchase. The clinical information contained in the information is intended as a supplement to, and not a substitute for, the knowledge, expertise, skill, and judgment of physicians, pharmacists, nurses, or other healthcare professionals involved in patient care. The absence of a warning for a given drug or drug combination should not be construed to indicate that the drug or drug combination is safe, appropriate, or effective in any given patient or under Your particular circumstances. THE INFORMATION FROM OR THROUGH THE SITE IS PROVIDED \"AS IS,\" \"AS AVAILABLE,\" AND DRUGS.COM AND THE CONTENT PROVIDERS MAKE NO WARRANTY OR REPRESENTATION, EXPRESS OR IMPLIED, AS TO THE ACCURACY OF THE DATA FROM WHICH THE INFORMATION IS COMPILED OR THE ACCURACY OF THE INFORMATION ITSELF AND SPECIFICALLY DISCLAIMS THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE INFORMATION AND SERVICES MAY CONTAIN BUGS, ERRORS, PROBLEMS OR OTHER LIMITATIONS. DRUGS.COM AND ITS AFFILIATED PARTIES HAVE NO LIABILITY WHATSOEVER FOR YOUR USE OF ANY INFORMATION OR SERVICE. WE ARE NOT LIABLE FOR ANY FAILURE TO PERFORM OR PERFORMANCE DUE TO A FORCE MAJEURE EVENT. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM US THROUGH THE SITE SHALL CREATE ANY WARRANTY, REPRESENTATION OR GUARANTEE NOT EXPRESSLY STATED IN THIS AGREEMENT. THIS WEBSITE AND THE CONTENT PROVIDERS OFFER NO MEDICAL ADVICE IN CONNECTION WITH THIS WEBSITE. USERS ARE RESPONSIBLE FOR THE USE OF THE CONTENT ON THIS WEBSITE. A LICENSED MEDICAL PROFESSIONAL IS RESPONSIBLE FOR INDEPENDENTLY REACHING ANY MEDICAL JUDGMENT, AND FOR ANY RESULTING DIAGNOSIS AND TREATMENTS, NOTWITHSTANDING ANY USE OF THE CONTENT BY SUCH MEDICAL PROFESSIONAL. BY USE OF THIS WEBSITE YOU ACKNOWLEDGE AND AGREE THAT THE INFORMATION ON THIS WEBSITE MAY CONTAIN INACCURACIES AND OTHER ERRORS. YOU USE THIS WEBSITE AND THE MATERIAL AND INFORMATION ON THE WEBSITE AT YOUR OWN RISK. DRUGS.COM AND THE CONTENT PROVIDERS ARE NOT LIABLE FOR ANY DAMAGES ALLEGEDLY SUSTAINED ARISING OUT OF USE OF THE WEB SITE, AND INCLUDING ANY CONSEQUENTIAL, SPECIAL, OR SIMILAR DAMAGES, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ALL RESPONSIBILITY OR LIABILITY FOR ANY DAMAGES CAUSED BY VIRUSES, WORMS OR OTHER MALICIOUS SOFTWARE CONTAINED WITHIN THE SITE IS DISCLAIMED. WE WILL NOT BE LIABLE TO YOU FOR ANY INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OF ANY KIND (INCLUDING LOST PROFITS) THAT MAY RESULT FROM USE OF, OR INABILITY TO USE OUR SITE. DRUGS.COM DOES NOT WARRANT OR MAKE REPRESENTATION REGARDING THE USE OR THE RESULTS OF THE USE OF THE MATERIALS IN THIS SITE IN TERMS OF THEIR CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE. AS A LIMITATION THEREOF, WE AND OUR AFFILIATED PARTIES ARE NOT LIABLE FOR ANY INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES FOR LOSS OF BUSINESS, LOSS OF PROFITS, LITIGATION, OR THE LIKE), WHETHER BASED ON BREACH OF CONTRACT, BREACH OF WARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE NEGATION OF DAMAGES SET FORTH ABOVE IS A FUNDAMENTAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN US AND YOU. THIS SITE AND THE INFORMATION WOULD NOT BE PROVIDED WITHOUT SUCH LIMITATIONS. IF, NOTWITHSTANDING THE OTHER TERMS OF THIS AGREEMENT (OR ANY OTHER AGREEMENT BETWEEN YOU AND US), WE (OR THE CONTENT PROVIDERS OR SPONSOR/ADVERTISERS) SHOULD HAVE ANY LIABILITY FOR ANY LOSS, HARM OR DAMAGE, YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT SUCH LIABILITY SHALL UNDER NO CIRCUMSTANCES EXCEED $1,000. YOU AND WE (ON BEHALF OF OURSELVES AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AGREE THAT THE FOREGOING LIMITATION OF LIABILITY IS AN AGREED ALLOCATION OF RISK BETWEEN YOU AND US (AND THE CONTENT PROVIDERS AND SPONSOR/ADVERTISERS) AND REFLECTS THE FEES, IF ANY, WE CHARGE YOU TO USE THIS SITE, THE SERVICES AND THE CONTENT. YOU ACKNOWLEDGE THAT ABSENT YOUR AGREEMENT TO THIS LIMITATION OF LIABILITY WE WOULD NOT PROVIDE THE WEBSITE, THE SERVICES, OR THE CONTENT TO YOU.", "raw_excerpt": "Terms and Conditions of Use for Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Support Terms Terms and Conditions Last updated: February 4th 2025 This website is intended for viewing by the USA audience only . If you are in another country, local laws may not permit access to the medical information contained in this site. Welcome to Drugs.com. This website is maintained as a service to our customers. By using Drugs.com, you are agreeing to comply with and be bound by the following terms of use. Please"}
{"source_url": "https://www.drugs.com/nucala.html", "site": "drugs.com", "generic_name": "Nucala", "brand_names": null, "indications": "Nucala is approved for: Severe asthma with an eosinophilic phenotype in adults and children aged 6 years and older as an add-on maintenance treatment. It is not a rescue medicine for acute bronchospasm or status asthmaticus Inadequately controlled chronic obstructive pulmonary disease (COPD) with an eosinophilic phenotype in adults as an add-on maintenance treatment Chronic rhinosinusitis with nasal polyps (CRSwNP) in adults aged 18 years and older whose disease is not controlled with nasal corticosteroids, as an add-on maintenance treatment. Nucala helps reduce symptoms (such as nasal congestion, nasal discharge, mucus in the throat, and loss of smell) and may help prevent surgery for nasal polyps Eosinophilic granulomatosis with polyangiitis (EGPA) in adults Hypereosinophilic syndrome [HES] in adults and children 12 years and older that has been present for 6 months or longer without an identifiable non-hematologic secondary cause.", "mechanism": "Nucala works by reducing levels of eosinophils in the blood. Eosinophils are a type of white blood cell that are involved in inflammation. The mechanism of action of Nucala involves targeting and preventing the immune system protein interleukin-5 (IL-5) from interacting with its receptor on eosinophils, reducing eosinophil levels and inflammation. Nucala belongs to the drug class interleukin inhibitors. It may also be called a monoclonal antibody or a biologic.", "dosage": "Pronunciation: new-KAH-la Generic name: mepolizumab Dosage form: single-dose prefilled autoinjector (100 mg/mL), single-dose prefilled syringe (100 mg/mL, 40 mg/0.4 mL), vial for subcutaneous injection (100 mg) Drug class: Interleukin inhibitors", "side_effects": "The most common side effects of Nucala are: headache feeling tired mouth or throat pain back pain, joint pain pain, swelling, redness, burning, or itching where the medicine was injected.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Nucala: Uses, Dosage, & Side Effects - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Nucala Print Save Nucala Play pronunciation Pronunciation: new-KAH-la Generic name: mepolizumab Dosage form: single-dose prefilled autoinjector (100 mg/mL), single-dose prefilled syringe (100 mg/mL, 40 mg/0.4 mL), vial for subcutaneous injection (100 mg) Drug class: Interleukin inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on May 28, 2025. Uses Side effects Before taking Dosage Overdose Interactio"}
{"source_url": "https://www.drugs.com/alpha/y.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'Y' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z Y Drugs: Y List of drugs and medications that start with the letter ' Y '. Ya Yb Yc Yd Ye Yf Yg Yh Yi Yj Yk Yl Ym Yn Yo Yp Yq Yr Ys Yt Yu Yv Yw Yx Yy Yz 0-9 Most Common 'Y' Drugs Common medications that begin with the letter ' Y ' Patient Info Professional Monographs Yasmin Yaz Ycanth Yellow fever vaccine Yervoy Yesafili Yescarta Yesintek Yeztugo Yohimbine Yondelis Yorvipath Yuflyma Yupelri Yusimry Yutrepia Y"}
{"source_url": "https://www.drugs.com/clinical_trials/protagonist-takeda-present-longer-term-data-ash-2025-showing-rusfertide-delivers-durable-response-22253.html", "site": "drugs.com", "generic_name": "Protagonist and Takeda Present Longer", "brand_names": null, "indications": "This press release contains information about products that may not be available in all countries, or may be available under different trademarks, for different indications, in different dosages, or in different strengths. Nothing contained herein should be considered a solicitation, promotion or advertisement for any prescription drugs including the ones under development.", "mechanism": null, "dosage": "Rusfertide has received Breakthrough Therapy Designation, Orphan Drug Designation and Fast Track Designation from the U.S. Food & Drug Administration (FDA).", "side_effects": "Rusfertide was generally well-tolerated through 52 Weeks of treatment. The most common treatment-emergent adverse events (AE) in rusfertide-treated patients were injection site reactions (47.4%), anemia (25.6%) and fatigue (19.6%), which were primarily grade 1 or 2. Serious AEs occurred in 8.1% of overall rusfertide-treated patients.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Protagonist and Takeda Present Longer-Term Data at ASH 2025 Showing Rusfertide Delivers Durable Response and Hematocrit Control in Polycythemia Vera - Drugs.com MedNews Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News Clinical Trials Print All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Protagonist and Takeda Present Longer-Term Data at ASH 2025 Showing Rusfertide Delivers Durable Response and Hematocrit Control in Polycythemia Vera NEWARK, California, OSAKA, Japan and CAMBRIDGE, Massachuse"}
{"source_url": "https://www.drugs.com/alpha/x.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'X' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z X Drugs: X List of drugs and medications that start with the letter ' X '. Xa Xb Xc Xd Xe Xf Xg Xh Xi Xj Xk Xl Xm Xn Xo Xp Xq Xr Xs Xt Xu Xv Xw Xx Xy Xz 0-9 Most Common 'X' Drugs Common medications that begin with the letter ' X ' Patient Info Professional Monographs Xacduro Xadago Xalatan Xalkori Xanax Xanax XR Xarelto Xcopri Xeljanz Xeloda Xelstrym Xenazine Xenical Xeomin Xermelo Xgeva Xhance Xiaflex Xifaxa"}
{"source_url": "https://www.drugs.com/palsonify.html", "site": "drugs.com", "generic_name": "Palsonify", "brand_names": null, "indications": "Cycloset is used to treat Type 2 Diabetes. Learn about side effects, interactions and indications.", "mechanism": "Palsonify mimics somatostatin, a natural hormone that regulates growth hormone production.", "dosage": "Take once daily with water Take on an empty stomach at least 6 hours after eating (after an overnight fast) or at least 1 hour before the next meal Follow your doctor's instructions exactly.", "side_effects": "Diarrhea Stomach area (abdominal) pain Nausea and vomiting Decreased appetite Slow heart rate (bradycardia) High blood sugar levels (hyperglycemia) Irregular heartbeat (palpitations).", "interactions": "Tell your healthcare provider about ALL the medications you take, including prescription medicines, over-the-counter medicines, herbal medicines, and supplements. Especially tell your healthcare provider if you take: Strong CYP3A4 Inducers (may require Palsonify dose increase), such as rifampin (antibiotic), carbamazepine (seizure medication), phenytoin (seizure medication), or St. John's Wort (herbal supplement) Moderate CYP3A4 Inducers (may require Palsonify dose increase), such as efavirenz (HIV medication), modafinil (sleep disorder medication), or bosentan (pulmonary hypertension medication) Proton Pump Inhibitors (may require Palsonify dose increase), such as omeprazole (Prilosec) •, esomeprazole (Nexium), lansoprazole (Prevacid), or pantoprazole (Protonix) Cyclosporine (may require cyclosporine dose adjustment): Heart Rate Medications (requires heart rate monitoring), such as beta-blockers (metoprolol, atenolol), calcium channel blockers (diltiazem, verapamil), and digoxin. Keep a complete list of all your medications and bring it to all doctor visits, pharmacy visits, and emergency room visits. Update when starting new medications, stopping medications, or changing doses. Does Palsonify interact with my other drugs? Enter medications to view a detailed interaction report using our Drug Interaction Checker. Drug name Add a drug to check interactions Add", "raw_excerpt": "Palsonify: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Palsonify Print Save Palsonify Play pronunciation Pronunciation: pal-SAHN-ih-fy Generic name: paltusotine Dosage form: tablet (20 mg, 30 mg) Medically reviewed by Carmen Pope, BPharm . Last updated on Sep 28, 2025. Uses Side effects Before taking Directions Dosage Interactions What is Palsonify? Acromegaly Treatment Palsonify is used to treat acromegaly in adults for whom pituitary surgery was unsuccessful"}
{"source_url": "https://www.drugs.com/support/privacy-history.html", "site": "drugs.com", "generic_name": "Privacy Policy Update History", "brand_names": null, "indications": "November 3rd, 2021: Clarified the use of Standard Contractual Clauses for data transfers to the United States.", "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Privacy Policy Update History for Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Support Privacy Policy Update History Privacy Policy Update History Click here to view the current Privacy Policy. July 22nd, 2025: Updated the Personal Data Request metrics for the previous calendar year. January 22nd, 2025: Added reference to our data breach notification process. October 3rd, 2024: Updated the number of users requesting to close accounts and opting out of the sale of personal data. May 12th, 2024: Added r"}
{"source_url": "https://www.drugs.com/news.html", "site": "drugs.com", "generic_name": "Pharmaceutical News and Articles", "brand_names": null, "indications": "INDIANAPOLIS, Dec. 3, 2025 /PRNewswire/ -- Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administration (FDA) has granted... 3 days ago New Drug Approvals", "mechanism": null, "dosage": "FRIDAY, Dec. 5, 2025 -- Most speakers attending U.S. Food and Drug Administration (FDA) Human Drug Advisory Committee meetings about new drugs or indications...", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Health, Medical & Pharma News - Updated Daily Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Pharmaceutical News and Articles All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Search Search Comprehensive and up-to-date drug news for both consumers and healthcare professionals. Healthy Routines Can Stay on Track — Even During Holiday Chaos SUNDAY, Dec. 7, 2025 — The holidays can bring travel, busy schedules and family events, and for many people, that means healthy habits slip. But experts... Today Da"}
{"source_url": "https://www.drugs.com/inactive/", "site": "drugs.com", "generic_name": "Inactive Drug Ingredients", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": "The FDA approves inactive ingredients that are included in pharmaceutical products. However, not all inactive ingredients are always inactive. Alcohol is one example of an ingredient that may be active or inactive based on the specific formulation of the medication. Patients may have allergic reactions or other adverse effects to inactive ingredients. If a patient has a known allergic reaction to an inactive ingredient, they should check for the ingredient in new prescription or over-the-counter medications or check with their pharmacist.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Inactive Drug Ingredients (Excipients) Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Inactive Drug Ingredients Inactive ingredients are components of a drug product that do not increase or affect the therapeutic action of the active ingredient, which is usually the active drug. Inactive ingredients are added during the manufacturing process of pharmaceutical products such as tablets, capsules, suppositories, and injections. Inactive ingredients may also be referred to as inert ingredients or excipients, and generally"}
{"source_url": "https://www.drugs.com/alpha/p.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'P' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z P Drugs: P List of drugs and medications that start with the letter ' P '. Pa Pb Pc Pd Pe Pf Pg Ph Pi Pj Pk Pl Pm Pn Po Pp Pq Pr Ps Pt Pu Pv Pw Px Py Pz 0-9 Most Common 'P' Drugs Common medications that begin with the letter ' P ' Patient Info Professional Monographs Pantoprazole Paracetamol Paragard Paroxetine Paxil Paxlovid pegcetacoplan ophthalmic Pembrolizumab Pentasa Pepcid Percocet Phenazopyridine Phene"}
{"source_url": "https://www.drugs.com/pregnancy/", "site": "drugs.com", "generic_name": "Medicine use during Pregnancy or Breastfeeding", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Pregnancy and Breastfeeding Warnings from Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Medicine use during Pregnancy or Breastfeeding Latest update: Safe medications during breastfeeding Search pregnancy medications Search Search Examples: amoxicillin, ibuprofen, lexapro Popular pregnancy and breastfeeding searches Albuterol Brilinta Celecoxib Dextromethorphan Digoxin Diltiazem Dupixent Enalapril Entresto Entyvio Ephedrine Farxiga Folic-acid Glipizide Guaifenesin Humira ibuprofen Januvia Jardiance Lisinopr"}
{"source_url": "https://www.drugs.com/cosentyx.html", "site": "drugs.com", "generic_name": "Cosentyx", "brand_names": null, "indications": "Uses: For active ankylosing spondylitis.", "mechanism": "HCPs and patients often use the Cosentyx Package Insert (PI) for more detailed information about this medicine. The Package Insert contains more comprehensive information on Indications and Usage, Dosage and Administration, Clinical Pharmacology, Clinical Studies, Drug Interaction, and more. Discuss any medical questions you have with your HCP (health care professional). This is not all the information you need to know about this medicine for safe and effective use, and it does not take the place of talking to your doctor about your treatment.", "dosage": "Pronunciation: koe-sen-tix Generic name: secukinumab [ SEK-ue-KIN-ue-mab ] Dosage form: Cosentyx pen, Cosentyx syringes, Cosentyx vial Drug class: Interleukin inhibitors", "side_effects": "Common Cosentyx side effects may include diarrhea and cold symptoms such as a stuffy nose, sneezing, and sore throat. Serious Cosentyx side effects Get emergency medical help if you have signs of an allergic reaction to Cosentyx with symptoms of hives, chest tightness, difficulty breathing, feeling like you might pass out, swelling of your face, lips, tongue, or throat. This medicine can cause serious bacterial, viral, and fungal opportunistic infections. Call your doctor right away if you have signs of infection, such as redness, warmth, or painful sores on your skin; cough, shortness of breath, cough with red or pink mucus; increased urination, burning when you urinate; sores or white patches in your mouth or throat (yeast infection or \"thrush\"); new or worsening diarrhea or stomach pain; or fever, chills, sweating, muscle pain, weight loss. Cases of Hepatitis B virus reactivation have occurred using this medicine. Further doses may be delayed until your infection clears up. This is not a complete list of side effects, and others may occur. Call your doctor for medical advice about side effects. You may report side effects to the FDA at 1-800-FDA-1088. Cosentyx side effects (more detail)", "interactions": "When starting or stopping this medicine, patients who are receiving a CYP450 substrate medicine, particularly those with a narrow therapeutic index, your therapeutic effect or drug concentration monitored, and you may need to have a dosage adjustment of the CYP450 substrate. To check for interactions with Cosentyx, click on the link below.", "raw_excerpt": "Cosentyx: Uses, Side Effects, Dose & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Cosentyx Print Save Cosentyx Play pronunciation Pronunciation: koe-sen-tix Generic name: secukinumab [ SEK-ue-KIN-ue-mab ] Dosage form: Cosentyx pen, Cosentyx syringes, Cosentyx vial Drug class: Interleukin inhibitors Medically reviewed by Melisa Puckey, BPharm . Last updated on Nov 6, 2025. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Cosentyx? Cosentyx ( secukinumab ) is a biologi"}
{"source_url": "https://www.drugs.com/newdrugs/u-s-fda-approves-expanded-indication-lilly-s-jaypirca-pirtobrutinib-adults-relapsed-refractory-cll-6681.html", "site": "drugs.com", "generic_name": "U.S. FDA Approves Expanded Indication for Lilly's Jaypirca (pirtobrutinib) for Adults with Relapsed or Refractory CLL/SLL", "brand_names": "Trademarks and Trade NamesAll trademarks or trade names referred to in this press release are the property of the company, or, to the extent trademarks or trade names belonging to other companies are referenced in this press release, the property of their respective owners. Solely for convenience, the trademarks and trade names in this press release are referred to without the ® and ™ symbols, but such references should not be construed as any indicator that the company or, to the extent applicable, their respective owners will not assert, to the fullest extent under applicable law, the company's or their rights thereto. We do not intend the use or display of other companies' trademarks and trade names to imply a relationship with, or endorsement or sponsorship of us by, any other companies.", "indications": "INDIANAPOLIS, Dec. 3, 2025 /PRNewswire/ -- Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administration (FDA) has granted approval to Jaypirca (pirtobrutinib, 100 mg & 50 mg tablets) for the treatment of adults with relapsed or refractory chronic lymphocytic leukemia or small lymphocytic lymphoma (CLL/SLL) who have previously been treated with a covalent Bruton tyrosine kinase (BTK) inhibitor. This FDA action expands the Jaypirca label to include patients earlier in their treatment course and also converts the December 2023 accelerated approval for later-line CLL/SLL to a traditional approval.1 \"Pirtobrutinib is the only medicine in CLL or SLL that has been prospectively studied in a randomized trial of patients previously treated with a covalent BTK inhibitor, and I am excited to see this expanded FDA approval recognize the benefit it can deliver to this broader group of patients,\" said Jeff Sharman, M.D., Disease Chair, Hematology Executive Committees, SCRI at Willamette Valley Cancer Institute and Research Center, and one of the principal investigators of the BRUIN CLL-321 trial. \"When covalent BTK inhibitors are no longer an option due to disease progression or intolerance, pirtobrutinib enables physicians to extend the benefits of targeting the BTK pathway, offering continuity in the CLL or SLL treatment experience.\" Jaypirca, the first and only FDA-approved non-covalent (reversible) BTK inhibitor, is a highly selective kinase inhibitor that utilizes a novel non-covalent binding mechanism to extend the benefit of targeting the BTK pathway in patients with relapsed or refractory CLL/SLL previously treated with a covalent BTK inhibitor (ibrutinib, acalabrutinib, or zanubrutinib).1,2 \"This label expansion allows physicians to use Jaypirca directly after a covalent BTK inhibitor, the setting where we have always believed it has its most unique potential impact for patients,\" said Jacob Van Naarden, executive vice president and president of Lilly Oncology. \"With robust efficacy and safety evidence from the only study of its kind in the post-covalent BTK inhibitor treatment setting, we're proud to now offer this therapy to more patients with CLL or SLL at an earlier stage of their treatment plan.\" \"For CLL or SLL patients who progress following treatment with an irreversible or covalently binding BTK inhibitor, having additional therapeutic options is critical,\" said Brian Koffman, M.D., co-founder and chief medical officer emeritus at CLL Society. \"With this approval, physicians and patients can stay in the same broad class of medicines with a treatment that offers meaningful impact on patient outcomes, saving the potential to use medicines with different targets for later therapy.\" Lilly is studying Jaypirca in CLL/SLL in multiple Phase 3 studies. Details on the trials can be found by visiting clinicaltrials.gov. About BRUIN CLL-321 BRUIN CLL-321 is a Phase 3, randomized, open-label study of Jaypirca versus investigator's choice of idelalisib plus rituximab (IdelaR) or bendamustine plus rituximab (BR) in covalent Bruton tyrosine kinase (BTK) inhibitor pre-treated patients with relapsed and refractory chronic lymphocytic leukemia (CLL) or small lymphocytic lymphoma (SLL). The trial enrolled 238 patients, who were randomized 1:1 to receive Jaypirca (200 mg orally, once daily) or investigator's choice of either IdelaR or BR per labeled doses. This trial's primary endpoint is progression-free survival (PFS) per 2018 International Workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria, as assessed by blinded independent review committee (IRC). Secondary endpoints include PFS, as assessed by investigator; overall response rate (ORR) and duration of response (DoR); event-free survival; overall survival (OS) and time to next treatment (TTNT); safety and tolerability; and patient-reported outcomes (PRO). About Jaypirca (pirtobrutinib) Jaypirca (pirtobrutinib, formerly known as LOXO-305) (pronounced jay-pihr-kaa) is a highly selective (300 times more selective for BTK versus 98% of other kinases tested in preclinical studies), non-covalent (reversible) inhibitor of the enzyme BTK.2 BTK is a validated molecular target found across numerous B-cell leukemias and lymphomas including mantle cell lymphoma (MCL) and chronic lymphocytic leukemia (CLL).3,4 Jaypirca is a U.S. FDA-approved oral prescription medicine, 100 mg or 50 mg tablets taken as a once-daily 200 mg dose with or without food until disease progression or unacceptable toxicity. About Chronic Lymphocytic Leukemia/Small Lymphocytic LymphomaChronic lymphocytic leukemia (CLL) and small lymphocytic lymphoma (SLL) are forms of slow-growing non-Hodgkin lymphoma that develop from white blood cells known as lymphocytes.5 CLL is one of the most common types of leukemia in adults.5 In the U.S., CLL accounts for about one-quarter of the new cases of leukemia and there will be approximately 23,690 new cases of CLL diagnosed this year.5,6 SLL is identical to CLL from a pathologic and immunophenotypic standpoint, with the main difference between them being the location of the cancer cells.5 In CLL, the cancer cells are present in the blood, and in SLL, the cancer cells are found in the lymph nodes.5 INDICATIONS FOR JAYPIRCA (pirtobrutinib)Jaypirca is indicated for the treatment of Adult patients with relapsed or refractory chronic lymphocytic leukemia or small lymphocytic lymphoma (CLL/SLL) who have previously been treated with a covalent BTK inhibitor. Adult patients with relapsed or refractory (R/R) mantle cell lymphoma (MCL) after at least two lines of systemic therapy, including a BTK inhibitor. This indication is approved under accelerated approval based on response rate. Continued approval for this indication may be contingent upon verification and description of clinical trial benefit in a confirmatory trial. IMPORTANT SAFETY INFORMATION FOR JAYPIRCA (pirtobrutinib) Infections: Fatal and serious infections (including bacterial, viral, fungal) and opportunistic infections occurred in Jaypirca-treated patients. Across clinical trials, Grade ≥3 infections occurred (25%), most commonly pneumonia (20%); fatal infections (5%), sepsis (6%), and febrile neutropenia (3.8%) occurred. In patients with CLL/SLL, Grade ≥3 infections occurred (32%), with fatal infections occurring in 8%. Opportunistic infections included Pneumocystis jirovecii pneumonia and fungal infection. Consider prophylaxis, including vaccinations and antimicrobial prophylaxis, in patients at increased risk for infection, including opportunistic infections. Monitor for signs and symptoms, evaluate, and treat. Based on severity, reduce dose, temporarily withhold, or permanently discontinue Jaypirca. Hemorrhage: Fatal and serious hemorrhage has occurred with Jaypirca. Across clinical trials, major hemorrhage (Grade ≥3 bleeding or any central nervous system bleeding) occurred (2.6%), including gastrointestinal hemorrhage; fatal hemorrhage occurred (0.3%). Bleeding of any grade, excluding bruising and petechiae, occurred (16%). Major hemorrhage occurred when taking Jaypirca with (2.0%) and without (0.6%) antithrombotic agents. Consider risks/benefits of co-administering antithrombotic agents with Jaypirca. Monitor for signs of bleeding. Based on severity, reduce dose, temporarily withhold, or permanently discontinue Jaypirca. Consider withholding Jaypirca 3-7 days pre- and post-surgery based on surgery type and bleeding risk. Cytopenias: Jaypirca can cause cytopenias, including neutropenia, thrombocytopenia, and anemia. Across clinical trials, Grade 3 or 4 cytopenias, including decreased neutrophils (27%), decreased platelets (13%), and decreased hemoglobin (11%), developed. Grade 4 decreased neutrophils (15%) and Grade 4 decreased platelets (6%) developed. Monitor complete blood counts regularly. Based on severity, reduce dose, temporarily withhold, or permanently discontinue Jaypirca. Cardiac Arrhythmias: Cardiac arrhythmias occurred in patients taking Jaypirca. Across clinical trials, atrial fibrillation or flutter were reported in 3.4% of Jaypirca treated patients, with Grade 3 or 4 atrial fibrillation or flutter in 1.6%. Other serious cardiac arrhythmias such as supraventricular tachycardia and cardiac arrest occurred (0.4%). Cardiac risk factors such as hypertension or previous arrhythmias may increase risk. Monitor and manage signs and symptoms of arrhythmias (e.g., palpitations, dizziness, syncope, dyspnea). Based on severity, reduce dose, temporarily withhold, or permanently discontinue Jaypirca. Second Primary Malignancies: Across clinical trials, second primary malignancies, including non-skin carcinomas, developed in 9% of Jaypirca-treated patients, most frequently non-melanoma skin cancer (4.4%). Other second primary malignancies included solid tumors (including genitourinary and breast cancers) and melanoma. Advise patients to use sun protection and monitor for development of second primary malignancies. Hepatotoxicity, Including Drug-Induced Liver Injury (DILI): Hepatotoxicity, including severe, life-threatening, and potentially fatal cases of DILI, has occurred in patients treated with BTK inhibitors, including Jaypirca. Evaluate bilirubin and transaminases at baseline and throughout Jaypirca treatment. For patients who develop abnormal liver tests after Jaypirca, monitor more frequently for liver test abnormalities and clinical signs and symptoms of hepatic toxicity. If DILI is suspected, withhold Jaypirca. If DILI is confirmed, discontinue Jaypirca. Embryo-Fetal Toxicity: Jaypirca can cause fetal harm. Administration of pirtobrutinib to pregnant rats caused embryo-fetal toxicity, including embryo-fetal mortality and malformations at maternal exposures (AUC) approximately 3-times the recommended 200 mg/day dose. Advise pregnant women of fetal risk and females of reproductive potential to use effective contraception during treatment and for one week after last dose. Adverse Reactions (ARs) in Patients Who Received Jaypirca The most common (≥30%) ARs in the pooled safety population of patients with hematologic malignancies (n=704) were decreased neutrophil count (54%), decreased hemoglobin (43%), decreased leukocytes (32%), fatigue (31%), decreased platelets (31%), decreased lymphocyte count (31%), calcium decreased (30%). Mantle Cell Lymphoma Serious ARs occurred in 38% of patients, with pneumonia (14%), COVID-19 (4.7%), musculoskeletal pain (3.9%), hemorrhage (2.3%), pleural effusion (2.3%), and sepsis (2.3%) occurring in ≥2% of patients. Fatal ARs within 28 days of last dose occurred in 7% of patients, most commonly due to infections (4.7%), including COVID-19 (3.1% of all patients). Dose Modifications and Discontinuations Due to ARs: Dose reductions in 4.7%, treatment interruption in 32%, and permanent discontinuation of Jaypirca in 9% of patients. Permanent discontinuation in >1% of patients included pneumonia. Most common ARs (≥15%) and Select Laboratory Abnormalities (≥10%) (all Grades %; Grade 3-4 %): hemoglobin decreased (42; 9), platelet count decreased (39; 14), neutrophil count decreased (36; 16), lymphocyte count decreased (32; 15), creatinine increased (30; 1.6), fatigue (29; 1.6), musculoskeletal pain (27; 3.9), calcium decreased (19; 1.6), diarrhea (19; -), edema (18; 0.8), dyspnea (17; 2.3), AST increased (17; 1.6), pneumonia (16; 14), bruising (16; -), potassium decreased (13; 1.6), sodium decreased (13; -), lipase increased (12; 4.4), ALT increased (11; 1.6), potassium increased (11; 0.8), alkaline phosphatase increased (11; -). Grade 4 laboratory abnormalities in >5% of patients included neutrophils decreased (10), platelets decreased (7), lymphocytes decreased (6). Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma from Single-Arm and Randomized Controlled Clinical Trials Serious ARs occurred in 47-56% of patients across clinical trials. Serious ARs in ≥5% of patients in the single-arm trial were pneumonia (18%), COVID-19 (9%), sepsis (7%), febrile neutropenia (7%). Serious ARs in ≥3% of patients in the randomized controlled trial were pneumonia (21%), COVID-19 (5%), sepsis (3.4%). Fatal ARs within 28-30 days of last Jaypirca dose occurred in 8-11% of patients, most commonly due to infections (7-10%), including sepsis (5%), COVID-19 (2.7-5%), and pneumonia (3.4%). Dose Modifications and Discontinuations Due to ARs: Dose reductions in 3.6-10%, treatment interruption in 42-51%, and permanent discontinuation of Jaypirca in 9-17% of patients. Permanent discontinuation in >1% of patients included second primary malignancy, pneumonia, COVID-19, neutropenia, sepsis, anemia, and cardiac arrythmias. Most common ARs and Select Laboratory Abnormalities (≥20%) (all Grades %, Grade 3-4 %)--in a randomized controlled trial: neutrophil count decreased (54; 26), hemoglobin decreased (45; 10), platelet count decreased (37; 17), pneumonia (28; 16), ALT increased (25; 1.8), creatinine increased (25; -), calcium decreased (23; 0.9), sodium decreased (22; 0.9), bilirubin increased (21; 0.9), upper respiratory tract infections (21; 0.9); in a single-arm trial: neutrophil count decreased (63; 45), hemoglobin decreased (48; 19), calcium decreased (40; 2.8), fatigue (36; 2.7), bruising (36; -), cough (33; -), musculoskeletal pain (32; 0.9), platelet count decreased (30; 15), sodium decreased (30; -), COVID-19 (28; 7), pneumonia (27; 16), diarrhea (26; -), abdominal pain (25; 2.7), lymphocyte count decreased (23; 8), ALT increased (23; 2.8), AST increased (23; 1.9), creatinine increased (23; -), dyspnea (22; 2.7), hemorrhage (22; 2.7), lipase increased (21; 7), alkaline phosphatase increased (21; -), edema (21; -), nausea (21; -), pyrexia (20; 2.7), headache (20; 0.9). Grade 4 laboratory abnormalities in >5% of patients included neutrophils decreased (23). Drug Interactions Strong CYP3A Inhibitors: Concomitant use increased pirtobrutinib systemic exposure, which may increase risk of Jaypirca ARs. Avoid using strong CYP3A inhibitors with Jaypirca. If concomitant use is unavoidable, reduce Jaypirca dose according to approved labeling. Strong or Moderate CYP3A Inducers: Concomitant use decreased pirtobrutinib systemic exposure, which may reduce Jaypirca efficacy. Avoid using Jaypirca with strong or moderate CYP3A inducers. If concomitant use with moderate CYP3A inducers is unavoidable, increase Jaypirca dose according to approved labeling. Sensitive CYP2C8, CYP2C19, CYP3A, P-gp, or BCRP Substrates: Use with Jaypirca increased their plasma concentrations, which may increase risk of ARs related to these substrates for drugs sensitive to minimal concentration changes. Follow recommendations for these sensitive substrates in their approved labeling. Use in Specific Populations Pregnancy and Lactation: Due to potential for Jaypirca to cause fetal harm, verify pregnancy status in females of reproductive potential prior to starting Jaypirca. Presence of pirtobrutinib in human milk is unknown. Advise women to use effective contraception and to not breastfeed while taking Jaypirca and for one week after last dose. Geriatric Use: In the pooled safety population of patients with hematologic malignancies, patients aged ≥65 years experienced higher rates of Grade ≥3 ARs and serious ARs compared to patients <65 years of age. Renal Impairment: Because severe renal impairment increases pirtobrutinib exposure, reduce Jaypirca dose in these patients according to approved labeling. About Lilly Lilly is a medicine company turning science into healing to make life better for people around the world. We've been pioneering life-changing discoveries for nearly 150 years, and today our medicines help tens of millions of people across the globe. Harnessing the power of biotechnology, chemistry and genetic medicine, our scientists are urgently advancing new discoveries to solve some of the world's most significant health challenges: redefining diabetes care; treating obesity and curtailing its most devastating long-term effects; advancing the fight against Alzheimer's disease; providing solutions to some of the most debilitating immune system disorders; and transforming the most difficult-to-treat cancers into manageable diseases. With each step toward a healthier world, we're motivated by one thing: making life better for millions more people. That includes delivering innovative clinical trials that reflect the diversity of our world and working to ensure our medicines are accessible and affordable. To learn more, visit Lilly.com and Lilly.com/news, or follow us on Facebook, Instagram, and LinkedIn. Trademarks and Trade NamesAll trademarks or trade names referred to in this press release are the property of the company, or, to the extent trademarks or trade names belonging to other companies are referenced in this press release, the property of their respective owners. Solely for convenience, the trademarks and trade names in this press release are referred to without the ® and ™ symbols, but such references should not be construed as any indicator that the company or, to the extent applicable, their respective owners will not assert, to the fullest extent under applicable law, the company's or their rights thereto. We do not intend the use or display of other companies' trademarks and trade names to imply a relationship with, or endorsement or sponsorship of us by, any other companies. Cautionary Statement Regarding Forward-Looking StatementsThis press release contains forward-looking statements (as that term is defined in the Private Securities Litigation Reform Act of 1995) about Jaypirca as a treatment for adults with relapsed or refractory chronic lymphocytic leukemia or small lymphocytic lymphoma (CLL/SLL) who have been previously treated with a covalent BTK inhibitor and as a treatment for adult patients with relapsed or refractory mantle cell lymphoma (MCL) after at least two lines of systemic therapy, including a BTK inhibitor, and reflects Lilly's current beliefs and expectations. However, as with any pharmaceutical product, there are substantial risks and uncertainties in the process of drug research, development, and commercialization. Among other things, there is no guarantee that planned or ongoing studies will be completed as planned, that future study results will be consistent with study results to date, or that Jaypirca will receive additional regulatory approvals. For further discussion of these and other risks and uncertainties that could cause actual results to differ from Lilly's expectations, see Lilly's Form 10-K and Form 10-Q filings with the United States Securities and Exchange Commission. Except as required by law, Lilly undertakes no duty to update forward-looking statements to reflect events after the date of this release. Endnotes & References Jaypirca. Prescribing Information. Lilly USA, LLC. Mato AR, Shah NN, Jurczak W, et al. Pirtobrutinib in relapsed or refractory B-cell malignancies (BRUIN): a phase 1/2 study. Lancet. 2021;397(10277):892-901. doi:10.1016/S0140-6736(21)00224-5 Hanel W, Epperla N. Emerging therapies in mantle cell lymphoma. J Hematol Oncol. 2020;13(1):79. Published 2020 Jun 17. doi:10.1186/s13045-020-00914-1 Gu D, Tang H, Wu J, Li J, Miao Y. Targeting Bruton tyrosine kinase using non-covalent inhibitors in B cell malignancies. J Hematol Oncol. 2021;14(1):40. Published 2021 Mar 6. doi:10.1186/s13045-021-01049-7 Mukkamalla SKR, Taneja A, Malipeddi D, et al. Chronic Lymphocytic Leukemia. [Updated Feb 18, 2023]. StatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2023 Jan. Available from: https://www.ncbi.nlm.nih.gov/books/NBK470433/ NCI SEER Program [NIH]. Cancer Stat Facts: Leukemia—Chronic Lymphocytic Leukemia (CLL). Accessed on September 3, 2025. https://seer.cancer.gov/statfacts/html/clyl.html SOURCE Eli Lilly and Company Add as a preferred source on Google", "mechanism": "Jaypirca, the first and only FDA-approved non-covalent (reversible) BTK inhibitor, is a highly selective kinase inhibitor that utilizes a novel non-covalent binding mechanism to extend the benefit of targeting the BTK pathway in patients with relapsed or refractory CLL/SLL previously treated with a covalent BTK inhibitor (ibrutinib, acalabrutinib, or zanubrutinib).1,2", "dosage": "INDIANAPOLIS, Dec. 3, 2025 /PRNewswire/ -- Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administration (FDA) has granted approval to Jaypirca (pirtobrutinib, 100 mg & 50 mg tablets) for the treatment of adults with relapsed or refractory chronic lymphocytic leukemia or small lymphocytic lymphoma (CLL/SLL) who have previously been treated with a covalent Bruton tyrosine kinase (BTK) inhibitor. This FDA action expands the Jaypirca label to include patients earlier in their treatment course and also converts the December 2023 accelerated approval for later-line CLL/SLL to a traditional approval.1", "side_effects": "Adverse Reactions (ARs) in Patients Who Received Jaypirca", "interactions": "Drug Interactions", "raw_excerpt": "U.S. FDA Approves Expanded Indication for Lilly's Jaypirca (pirtobrutinib) for Adults with Relapsed or Refractory CLL/SLL Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News New Drugs Print Save All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts U.S. FDA Approves Expanded Indication for Lilly's Jaypirca (pirtobrutinib) for Adults with Relapsed or Refractory CLL/SLL INDIANAPOLIS, Dec. 3, 2025 /PRNewswire/ -- Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administrati"}
{"source_url": "https://www.drugs.com/answers/", "site": "drugs.com", "generic_name": "Drugs.com Answers", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Medical Questions Answered Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Q & A Drugs.com Answers Welcome to the Drugs.com Q&A site: providing support from community members for people with questions about medicines and medical conditions. For other enquiries, visit our support page . Search Search Ask questions The Drugs.com Answers and Support Group system is intended as a way of providing help for people who have questions about drugs or medical conditions. Ask a Question Help others See what people are asking"}
{"source_url": "https://www.drugs.com/inluriyo.html", "site": "drugs.com", "generic_name": "Inluriyo", "brand_names": null, "indications": null, "mechanism": "Inluriyo is an oral SERD therapy that works through estrogen receptor degradation: Imlunestrant attaches to estrogen receptors (ERα) on cancer cells Causes receptor breakdown and disappearance Blocks estrogen growth signals to cancer cells Stops cancer cell multiplication and growth This mechanism is particularly effective against hormone therapy resistance caused by ESR1 mutations.", "dosage": "Pronunciation: en-loo-ree-yoh Generic name: Imlunestrant Dosage form: tablet (200 mg)", "side_effects": "Decreased hemoglobin (anemia) Muscle and joint pain Decreased white blood cell counts Increased liver function tests Decreased blood calcium levels Nausea Decreased platelet counts Constipation Stomach-area (abdominal) pain Tiredness Diarrhea Increased triglyceride and cholesterol blood levels. Your healthcare provider will monitor your blood levels before and during treatment and may adjust dosing if needed. Warnings: Inluriyo may cause harm to an unborn baby (see pregnancy and breastfeeding considerations below). These are not all of the possible side effects of Inluriyo. Call your doctor for medical advice about side effects. You may report side effects to the FDA at 1-800-FDA-1088. Inluriyo side effects (more detail)", "interactions": "Xeloda is used to treat breast and colorectal cancers. Learn about side effects, interactions and ...", "raw_excerpt": "Inluriyo: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Inluriyo Print Save Inluriyo Play pronunciation Pronunciation: en-loo-ree-yoh Generic name: Imlunestrant Dosage form: tablet (200 mg) Medically reviewed by Carmen Pope, BPharm . Last updated on Oct 17, 2025. Uses Side effects Before taking Directions Dosage Interactions What is Inluriyo? ESR1-Mutated Breast Cancer Treatment Inluriyo is used to treat adults with ER-positive, HER2-negative, ESR1-mutated advance"}
{"source_url": "https://www.drugs.com/kesimpta.html", "site": "drugs.com", "generic_name": "Kesimpta", "brand_names": "Arzerra", "indications": null, "mechanism": null, "dosage": "Weeks 0, 1, 2: 20 mg subcutaneously (SC) Week 3: No injection Week 4 and monthly thereafter: 20 mg subcutaneously (SC) Detailed Kesimpta dosage information", "side_effects": "The most common side effects of Kesimpta are: upper respiratory tract infections with symptoms such as a sore throat, runny nose, and headache headache.", "interactions": "This list is not complete. Other drugs may affect Kesimpta, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here. Tell your healthcare provider about all the medicines you take, including prescription and over-the-counter medicines, vitamins, and herbal supplements. Know the medicines you take. Keep a list of them to show your healthcare provider and pharmacist when you get a new medicine.", "raw_excerpt": "Kesimpta: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Kesimpta Print Save Kesimpta Play pronunciation Pronunciation: key-simp-ta Generic name: ofatumumab Dosage form: single-dose prefilled Sensoready pen for subcutaneous use (20 mg/0.4 mL), single-dose prefilled syringe for subcutaneous use (20 mg/0.4 mL) Drug classes: CD20 monoclonal antibodies , Selective immunosuppressants Medically reviewed by Carmen Pope, BPharm . Last updated on June 16, 2025. Uses Side ef"}
{"source_url": "https://www.drugs.com/clinical_trials/belite-bio-announces-positive-topline-results-pivotal-global-phase-3-dragon-trial-tinlarebant-22251.html", "site": "drugs.com", "generic_name": "Belite Bio Announces Positive Topline Results from the Pivotal Global, Phase 3 DRAGON Trial of Tinlarebant in Adolescents with Stargardt Disease", "brand_names": null, "indications": null, "mechanism": "“The significant lesion growth reduction observed in the DRAGON study, along with the favorable safety profile, provide important validation of our therapeutic approach and the mechanism of Tinlarebant. These results underscore the team’s commitment to addressing the unmet need in Stargardt disease and the potential to meaningfully improve the quality of life for those affected,” said Dr. Nathan Mata, Chief Scientific Officer at Belite Bio.", "dosage": null, "side_effects": null, "interactions": "“The final results from the DRAGON trial mark a historic breakthrough in Stargardt disease, paving the way for the first potential treatment for this devastating condition and bringing new hope to patients and families who have long faced a disease once considered untreatable,” said Dr. Tom Lin, Chairman and CEO of Belite Bio. “Not only was Tinlarebant shown to be efficacious in slowing retinal degeneration, but this is also the first time that an oral treatment was able to demonstrate a clinically meaningful outcome in retinal degenerative disease. With this data, we are advancing our regulatory interactions globally and moving closer to delivering the first approved treatment for people living with Stargardt disease. We extend our sincere gratitude to the patients, families, and investigators whose dedication made this achievement possible.”", "raw_excerpt": "Belite Bio Announces Positive Topline Results from the Pivotal Global, Phase 3 DRAGON Trial of Tinlarebant in Adolescents with Stargardt Disease - Drugs.com MedNews Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News Clinical Trials Print All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Belite Bio Announces Positive Topline Results from the Pivotal Global, Phase 3 DRAGON Trial of Tinlarebant in Adolescents with Stargardt Disease SAN DIEGO, Dec. 01, 2025 (GLOBE NEWSWIRE) -- Belite Bio, Inc (NASD"}
{"source_url": "https://www.drugs.com/botox.html", "site": "drugs.com", "generic_name": "Botox Injection", "brand_names": "Pronunciation: Boe-tox Generic name: onabotulinumtoxinA Other brand names of onabotulinumtoxinA include: Botox Therapeutic, Botox Cosmetic Dosage form: single-dose vial (50, 100, 200 Units) Drug class: Skeletal muscle relaxants", "indications": "Play pronunciation", "mechanism": null, "dosage": "Pronunciation: Boe-tox Generic name: onabotulinumtoxinA Other brand names of onabotulinumtoxinA include: Botox Therapeutic, Botox Cosmetic Dosage form: single-dose vial (50, 100, 200 Units) Drug class: Skeletal muscle relaxants", "side_effects": "Common side effects include mild bruising or redness. Serious side effects are rare but may include drooping eyelids or difficulty swallowing.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Botox Injection: Medical & Cosmetic Uses Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Botox Print Save Botox Injection: Medical & Cosmetic Uses Play pronunciation Pronunciation: Boe-tox Generic name: onabotulinumtoxinA Other brand names of onabotulinumtoxinA include: Botox Therapeutic, Botox Cosmetic Dosage form: single-dose vial (50, 100, 200 Units) Drug class: Skeletal muscle relaxants Medically reviewed by Carmen Pope, BPharm . Last updated on Dec 5, 2025. Uses Cost Side effects Before taking What to avoid D"}
{"source_url": "https://www.drugs.com/news/healthy-routines-can-track-even-during-holiday-chaos-127842.html", "site": "drugs.com", "generic_name": "Healthy Routines Can Stay on Track — Even During Holiday Chaos", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Healthy Routines Can Stay on Track — Even During Holiday Chaos - Drugs.com MedNews Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News Consumer News Print All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Healthy Routines Can Stay on Track — Even During Holiday Chaos By I. Edwards HealthDay Reporter Medically reviewed by Carmen Pope, BPharm . Last updated on Dec 7, 2025. via HealthDay SUNDAY, Dec. 7, 2025 — The holidays can bring travel, busy schedules and family events, and for many people, tha"}
{"source_url": "https://www.drugs.com/pro/", "site": "drugs.com", "generic_name": "FDA Prescribing Information", "brand_names": null, "indications": null, "mechanism": "Access comprehensive, FDA-approved prescribing information, including detailed clinical pharmacology data for over 5,000 medications.", "dosage": "Product labeling from the United States Food and Drug Administration (FDA) includes professional information, package inserts, and medication guides. This content is sourced directly from manufacturer-compiled, FDA-approved product monographs. Drugs.com reformats these monographs for clarity while maintaining all FDA-approved content.", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "FDA Prescribing Information for Professionals Skip to main content Search Drugs.com Close Professional Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close FDA Prescribing Information Access comprehensive, FDA-approved prescribing information, including detailed clinical pharmacology data for over 5,000 medications. Search professional drug information Search Search Examples: amoxicillin, gabapentin, metformin About FDA drug information Product labeling from the United States Food and Drug Administration (FDA) includes professional information, package inserts, and medic"}
{"source_url": "https://www.drugs.com/dupixent.html", "site": "drugs.com", "generic_name": "Dupixent", "brand_names": null, "indications": "Yes, it does appear that Dupixent can cause weight gain, although this is not listed as a side effect in the product information. A case series of 12 people prescribed Dupixent reported an average weight gain of 6.1kg over one year – the amount of weight gained ranged from 0.1kg to 18.0kg. Anecdotally, blog sites also report weight gain as a side effect. How Dupixent causes weight gain is not known; however, people should be informed that weight gain may be a possible side effect of Dupixent. Continue reading", "mechanism": null, "dosage": "Pronunciation: DU-pix-ent Generic name: dupilumab Dosage form: single-dose pre-filled syringe (300 mg/2 mL and 200 mg/1.14 mL), single-dose pre-filled pen (300 mg/2 mL and 200 mg/1.14 mL) Drug class: Interleukin inhibitors", "side_effects": "The most common side effects of Dupixent are: Injection site reactions Upper respiratory tract infections Eye problems, including eye and eyelid inflammation, redness, swelling, itching, eye infection, dry eye, and blurred vision Herpes virus infections Common cold symptoms (nasopharyngitis) Cold sores in your mouth or on your lips High count of a certain white blood cell (eosinophilia) Viral infections Back pain Inflammation inside the nose (rhinitis) Dizziness Muscle pain Diarrhea Pain in the throat (oropharyngeal pain) Stomach problems (gastritis) Joint pain (arthralgia) Trouble sleeping (insomnia) Toothache Parasitic (helminth) infections Headache Urinary tract infections. It is common for Dupixent injections to hurt (see Why do Dupixent injections hurt so much?).", "interactions": "This list is not complete. See the Dupixent Prescribing Information for a full list. Other drugs may interact with Dupixent, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Dupixent: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Dupixent Print Save Dupixent Play pronunciation Pronunciation: DU-pix-ent Generic name: dupilumab Dosage form: single-dose pre-filled syringe (300 mg/2 mL and 200 mg/1.14 mL), single-dose pre-filled pen (300 mg/2 mL and 200 mg/1.14 mL) Drug class: Interleukin inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on Dec 5, 2025. Uses Side effects Before taking Dosage What to avoid Interactions FA"}
{"source_url": "https://www.drugs.com/support/about.html", "site": "drugs.com", "generic_name": "About Us", "brand_names": null, "indications": "Drugs.com is NOT an online pharmacy and does not condone the sale of prescription medicines over the Internet without a prescription. Drugs.com simply provides a free drug-information service to help you better understand how medicines work: their uses, side effects and potential to interact with other medicines. For information on purchasing prescription medicines online please visit the FDA's Buying Prescription Medicine Online: A Consumer Safety Guide.", "mechanism": null, "dosage": null, "side_effects": "Drugs.com is NOT an online pharmacy and does not condone the sale of prescription medicines over the Internet without a prescription. Drugs.com simply provides a free drug-information service to help you better understand how medicines work: their uses, side effects and potential to interact with other medicines. For information on purchasing prescription medicines online please visit the FDA's Buying Prescription Medicine Online: A Consumer Safety Guide.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "About Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Support About Drugs.com About Us Mission Statement \"To empower patients with the knowledge to better manage their own healthcare and to improve consumer safety by assisting in the reduction of medication errors.\" Drugs.com is the largest, most widely visited, independent medicine information website available on the Internet. Our aim is to be the Internet's most trusted resource for drug and related health information. We will achieve this aim by pres"}
{"source_url": "https://www.drugs.com/mednotes/", "site": "drugs.com", "generic_name": "My Med List", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "From in-depth consumer information, drug interaction data (including food, allergy, condition interactions) to historical news, and FDA alerts.", "raw_excerpt": "My Med List - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support My Med List Organize your medications into an easy-to-read format, that provides in-depth drug interaction data, news, and FDA alerts. Create an account Already have an account? Sign in Multiple profiles, made easy Keep separate medication lists for yourself or family members Specify age and sex separately for each profile to get only the most relevant information, including pregnancy and lactation warnings. Your comprehensive guide From in-depth consume"}
{"source_url": "https://www.drugs.com/ubrelvy.html", "site": "drugs.com", "generic_name": "Ubrelvy", "brand_names": null, "indications": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use Ubrelvy only for the indication prescribed.", "mechanism": "Ubrelvy mechanism of action involves binding to CGRP receptors and preventing CGRP from triggering inflammation, dilation of blood vessels, and pain in the brain. By inhibiting CGRP, Ubrelvy helps reduce migraine symptoms such as headache, nausea, and sensitivity to light and sound. It is unlike some traditional migraine treatments, which constrict blood vessels, Ubrelvy specifically targets this pathway without causing vascular side effects.", "dosage": "Pronunciation: you-brel-vee Generic name: ubrogepant Dosage form: 50mg tablet, 100mg tablet Drug class: CGRP inhibitors", "side_effects": "Common Ubrelvy side effects may include nausea or sleepiness. Serious Ubrelvy side effects Get emergency medical help if you have signs of an allergic reaction to Ubrelvy: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Ubrelvy side effects (more detail)", "interactions": "This list is not complete and many Other drugs may interact with ubrogepant. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Ubrelvy for Migraines: Uses, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Ubrelvy Print Save Ubrelvy Play pronunciation Pronunciation: you-brel-vee Generic name: ubrogepant Dosage form: 50mg tablet, 100mg tablet Drug class: CGRP inhibitors Medically reviewed by Melisa Puckey, BPharm . Last updated on Sep 25, 2025. Uses Side effects Warnings Cost Dosage Interactions FAQ What is Ubrelvy? Ubrelvy tablets are used to treat migraine headaches in adults, that are with or without aur"}
{"source_url": "https://www.drugs.com/naloxone.html", "site": "drugs.com", "generic_name": "Naloxone", "brand_names": "Narcan, Kloxxado, Evzio, Zimhi, ... +2 more", "indications": "Naloxone has different uses when used in multi-ingredient medications including buprenorphine with naloxone (Suboxone, Zubsolv, Bunavail) which is used to treat opioid addiction, and naloxone with oxycodone (Targiniq ER) which is used for pain.", "mechanism": null, "dosage": "Generic name: naloxone [ nah-LOX-one ] Brand names: Narcan, Rezenopy, Kloxxado, Zimhi Dosage form: Injectable solution (Zimhi 5 mg/0.5 mL), Nasal spray (Narcan 4 mg, Rezenopy 10 mg, Kloxxado 8 mg) Drug class: Antidotes", "side_effects": "Get emergency medical help if you have signs of an allergic reaction to naloxone: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. Because naloxone reverses opioid effects, the administration may cause sudden withdrawal symptoms such as: nausea, vomiting, diarrhea, stomach pain; fever, sweating, body aches, weakness; tremors or shivering, fast heart rate, pounding heartbeats, increased blood pressure; goose bumps, shivering; runny nose, yawning; or feeling nervous, restless, or irritable. Sudden withdrawal symptoms in a baby younger than 4 weeks old may be life-threatening if not treated the right way. Symptoms include crying, stiffness, overactive reflexes, and seizures. Call your doctor or get emergency medical help if you are unsure how to properly give this medicine to a baby. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Naloxone side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Naloxone: Opioid Overdose, Instructions, Side Effects - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Naloxone Print Save Naloxone Play pronunciation Generic name: naloxone [ nah-LOX-one ] Brand names: Narcan , Rezenopy , Kloxxado , Zimhi Dosage form: Injectable solution (Zimhi 5 mg/0.5 mL), Nasal spray (Narcan 4 mg, Rezenopy 10 mg, Kloxxado 8 mg) Drug class: Antidotes Medically reviewed by Melisa Puckey, BPharm . Last updated on May 22, 2024. Uses Warnings Before taking Dosage Side effects Interaction"}
{"source_url": "https://www.drugs.com/descovy.html", "site": "drugs.com", "generic_name": "Descovy", "brand_names": "Cabotegravir is an antiviral medication used for the prevention and treatment of HIV. Brand names ...", "indications": "The two antivirals in Descovy, emtricitabine with tenofovir alafenamide, work by blocking the activity of reverse transcriptase, an enzyme produced by the human immunodeficiency virus that allows it to infect cells and replicate (make more viruses). Emtricitabine and tenofovir alafenamide both belong to the drug class called nucleoside reverse transcriptase inhibitors (NRTIs).", "mechanism": null, "dosage": "Pronunciation: Des-co-vee Generic name: emtricitabine and tenofovir alafenamide Dosage form: oral tablet (200 mg/25 mg, 120 mg/15 mg) Drug class: Antiviral combinations", "side_effects": "Side effects are similar between Descovy for PrEP and Descovy for HIV treatment, since the medication and dosing are the same. The most common side effects are diarrhea, nausea, headache, fatigue, and stomach discomfort. Descovy side effects (more detail) Discontinuation rates due to side effects are low with HIV-1 PrEP: 1% with Descovy vs 2% for Truvada over the ~96-week (minimum 2-year) treatment period in the DISCOVER clinical trial.", "interactions": "No clinically significant drug interactions have been either observed or are expected when Descovy is combined with atazanavir with ritonavir, atazanavir with cobicistat (in those weighing greater than or equal to 35 kg), darunavir with ritonavir or cobicistat, dolutegravir, efavirenz, ledipasvir, lopinavir/ritonavir, maraviroc, nevirapine, raltegravir, rilpivirine, and sofosbuvir.", "raw_excerpt": "Descovy: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Descovy Print Save Descovy Play pronunciation Pronunciation: Des-co-vee Generic name: emtricitabine and tenofovir alafenamide Dosage form: oral tablet (200 mg/25 mg, 120 mg/15 mg) Drug class: Antiviral combinations Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 30, 2025. Uses Side effects Before taking Dosage Overdose Interactions FAQ What is Descovy? Descovy is used to treat and prevent HIV i"}
{"source_url": "https://www.drugs.com/health-guide/", "site": "drugs.com", "generic_name": "Harvard Health Topics", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Harvard Health Topics A-Z Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Harvard Health Topics These authoritative articles, sourced from Harvard Health Publications , provide comprehensive information about medical conditions, diseases, procedures, and devices. Each topic includes detailed definitions, descriptions, symptoms, diagnostic methods, treatment options, prognosis, and additional resources. For more information on diseases and conditions, see: Micromedex CareNotes . Search Search Examples: acne, diabetes, t"}
{"source_url": "https://www.drugs.com/emgality.html", "site": "drugs.com", "generic_name": "Emgality", "brand_names": null, "indications": null, "mechanism": null, "dosage": "Pronunciation: em-GAL-it-ē Generic name: galcanezumab [ GAL-ka-NEZ-ue-mab ] Dosage forms: prefilled pen (120 mg/mL), prefilled syringe (100 mg/mL, 120 mg/mL) Drug class: CGRP inhibitors", "side_effects": "Common side effects of Emgality may include: pain; redness; itching; irritation where the medicine was injected. Serious side effects of Emgality Get emergency medical help if you have signs of an allergic reaction to Emgality: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. An allergic reaction to the active ingredient galcanezumab can occur several days after an injection. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Emgality side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Emgality: Uses, Dosage, Side Effects, Warnings Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Emgality Print Save Emgality Play pronunciation Pronunciation: em-GAL-it-ē Generic name: galcanezumab [ GAL-ka-NEZ-ue-mab ] Dosage forms: prefilled pen (120 mg/mL), prefilled syringe (100 mg/mL, 120 mg/mL) Drug class: CGRP inhibitors Medically reviewed by Melisa Puckey, BPharm . Last updated on Sep 5, 2024. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Emgality? Emgality is a prescription medic"}
{"source_url": "https://www.drugs.com/ibuprofen.html", "site": "drugs.com", "generic_name": "Ibuprofen", "brand_names": "Advil, IBU, Motrin IB, Nuprin, ... +13 more", "indications": "Cyclobenzaprine is a muscle relaxant used for short-term pain relief. Learn about its uses, dosage ...", "mechanism": null, "dosage": "Pronunciation: EYE-bue-PROE-fen Generic name: ibuprofen Brand names: Advil, Genpril, IBU, Midol IB, Motrin IB, Proprinal, Smart Sense Children's Ibuprofen Dosage forms: oral capsule (200 mg), oral suspension (100 mg/5 mL; 50 mg/1.25 mL), oral tablet (100 mg; 200 mg; 400 mg; 600 mg; 800 mg), ... show all 4 dosage forms oral tablet, chewable (100 mg; 50 mg) Drug class: Nonsteroidal anti-inflammatory drugs", "side_effects": "Get emergency medical help if you have signs of an allergic reaction to ibuprofen (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning eyes, skin pain, red or purple skin rash with blistering and peeling). Get emergency medical help if you have signs of a heart attack or stroke: chest pain spreading to your jaw or shoulder, sudden numbness or weakness on one side of the body, slurred speech, leg swelling, feeling short of breath. Stop using this medicine and call your doctor at once if you have: changes in your vision; shortness of breath (even with mild exertion); swelling or rapid weight gain; a skin rash, no matter how mild; signs of stomach bleeding - bloody or tarry stools, coughing up blood or vomit that looks like coffee grounds; liver problems - nausea, upper stomach pain, itching, tired feeling, flu-like symptoms, loss of appetite, dark urine, clay-colored stools, jaundice (yellowing of the skin or eyes); low red blood cells (anemia) - pale skin, feeling light-headed or short of breath, rapid heart rate, trouble concentrating; or kidney problems - little or no urinating, painful or difficult urination, swelling in your feet or ankles, feeling tired or short of breath. Common ibuprofen side effects may include: nausea, vomiting, gas; bleeding; or dizziness, headache. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Ibuprofen side effects (more detail)", "interactions": "This list is not complete. Other drugs may interact with ibuprofen, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Ibuprofen Uses, Dosage & Side Effects - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Ibuprofen Print Save Ibuprofen Play pronunciation Pronunciation: EYE-bue-PROE-fen Generic name: ibuprofen Brand names: Advil , Genpril , IBU , Midol IB , Motrin IB , Proprinal , Smart Sense Children's Ibuprofen Dosage forms: oral capsule (200 mg), oral suspension (100 mg/5 mL; 50 mg/1.25 mL), oral tablet (100 mg; 200 mg; 400 mg; 600 mg; 800 mg), ... show all 4 dosage forms oral tablet, chewable (100 mg; 50 mg) Drug cl"}
{"source_url": "https://www.drugs.com/alpha/r.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'R' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z R Drugs: R List of drugs and medications that start with the letter ' R '. Ra Rb Rc Rd Re Rf Rg Rh Ri Rj Rk Rl Rm Rn Ro Rp Rq Rr Rs Rt Ru Rv Rw Rx Ry Rz 0-9 Most Common 'R' Drugs Common medications that begin with the letter ' R ' Patient Info Professional Monographs Rabeprazole Raloxifene Ramelteon Ramipril Ranexa Ranitidine Ranolazine Rapamune ravulizumab Rebif Reclast Reglan Relafen Relugolix Remeron Remic"}
{"source_url": "https://www.drugs.com/lynkuet.html", "site": "drugs.com", "generic_name": "Lynkuet", "brand_names": null, "indications": "Women who are pregnant", "mechanism": "Unlike hormone replacement therapy, Lynkuet works through a unique mechanism. The active ingredient elinzanetant is a dual neurokinin 1 (NK1) and neurokinin 3 (NK3) receptor antagonist.", "dosage": "Take at approximately the same time each evening Can be taken with or without food Swallow capsules whole with water Do not cut, crush, or chew the capsules If taking certain medications, your doctor may reduce your dose to 1 capsule daily.", "side_effects": "Side effects reported by 5% or more of patients include: Headache Fatigue Dizziness Drowsiness or sleepiness (somnolence) Abdominal pain Rash Diarrhea Muscle spasms.", "interactions": "Certain medications can affect how Lynkuet works in your body or increase the risk of side effects. Always inform your healthcare provider about all medicines you take, including prescription medications, over-the-counter drugs, vitamins and supplements, and herbal products", "raw_excerpt": "Lynkuet: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Lynkuet Print Save Lynkuet Play pronunciation Pronunciation: lin-kew-et Generic name: elinzanetant Dosage form: oral capsule (60 mg) Medically reviewed by Carmen Pope, BPharm . Last updated on Oct 28, 2025. Uses Side effects Before taking Dosage What to avoid Interactions What is Lynkuet? Lynkuet is a non-hormonal prescription treatment used to treat moderate to severe hot flashes (vasomotor symptoms) associa"}
{"source_url": "https://www.drugs.com/enhertu.html", "site": "drugs.com", "generic_name": "Enhertu", "brand_names": null, "indications": "Review the Enhertu PI (Package Insert) contains more comprehensive information on Indications and Usage, Dosage and Administration, Clinical Pharmacology, Clinical Studies, Drug Interaction, and more. Refer to the Enhertu PI and discuss any medical questions you have with your doctor or other health care provider. This is not all the information you need to know about this medicine for safe and effective use, and it does not take the place of talking to your doctor about your treatment.", "mechanism": "Enhertu mechanism of action is as a HER2-directed antibody-drug conjugate.", "dosage": "Pronunciation: en-HER-too Generic name: fam-trastuzumab deruxtecan [ FAM-tras-TOOZ-ue-mab-DER-ux-TEE-kan ] Dosage form: intravenous infusion (100mg vial) Drug class: HER2 inhibitors", "side_effects": "Common Enhertu side effects may include hair loss, nausea, vomiting, loss of appetite, diarrhea, constipation, cough, fever, tiredness (fatigue), muscle and joint pain, low blood cell counts, low potassium, and abnormal liver function tests. These common side effects occurred in 20% or more of patients on Enhertu during the DESTINY-Breast03 (NCT03529110) clinical trials. The most common Enhertu side effects are gastrointestinal side effects, with 76% of patients having nausea and 49 % of patients having vomiting in the DESTINY-Breast03 trial. Your healthcare provider will give you medicines before your infusion to help prevent nausea and vomiting, and you may be prescribed nausea and vomiting medications to take at home. Talk to your HCP if you are experiencing problems with vomiting, nausea, constipation, or diarrhea.", "interactions": "Some medications interact with Enhertu, so it is important to tell your doctor about any medicines that you are currently taking, or if you start or stop any medicine while you are having cancer treatment. Also tell your doctor about any vaccinations, over-the-counter medicines, vitamins, minerals or herbal products that you take. Enhertu drug interactions (more detail) Does Enhertu interact with my other drugs? Enter medications to view a detailed interaction report using our Drug Interaction Checker. Drug name Add a drug to check interactions Add", "raw_excerpt": "Enhertu: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Enhertu Print Save Enhertu Play pronunciation Pronunciation: en-HER-too Generic name: fam-trastuzumab deruxtecan [ FAM-tras-TOOZ-ue-mab-DER-ux-TEE-kan ] Dosage form: intravenous infusion (100mg vial) Drug class: HER2 inhibitors Medically reviewed by Melisa Puckey, BPharm . Last updated on May 23, 2025. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Enhertu? Enhertu is a treatment for"}
{"source_url": "https://www.drugs.com/leqembi.html", "site": "drugs.com", "generic_name": "Leqembi", "brand_names": "Pronunciation: leh-kem’-bee Generic name: lecanemab Other brand names of lecanemab include: Leqembi, Leqembi Iqlik Dosage form: injection for infusion (200 mg/2 mL, 500 mg/5 mL), autoinjector for subcutaneous use (360 mg/1.8 mL) Drug class: Miscellaneous central nervous system agents", "indications": "Alzheimer’s disease is a form of dementia that affects memory, thinking, and behavior. Over time, it can interfere with daily activities. One of the causes of Alzheimer’s disease is thought to be abnormal buildup in the brain of a protein (amyloid) into clumps or plaques, which makes it harder for brain cells to communicate with each other and results in the symptoms of Alzheimer’s disease.", "mechanism": "Leqembi's mechanism of action is as an amyloid beta-directed antibody against aggregated soluble and insoluble forms of amyloid beta.", "dosage": "Pronunciation: leh-kem’-bee Generic name: lecanemab Other brand names of lecanemab include: Leqembi, Leqembi Iqlik Dosage form: injection for infusion (200 mg/2 mL, 500 mg/5 mL), autoinjector for subcutaneous use (360 mg/1.8 mL) Drug class: Miscellaneous central nervous system agents", "side_effects": "The most common side effects of Leqembi are: headache infusion-related reactions, which can be serious swelling in areas of the brain, with or without small bleeding spots in or on the brain's surface (ARIA). Infusion-related reactions. Infusion-related reactions occurred in 26% of Leqembi patients compared to 7% of placebo patients in the Clarity AD (Study 2 NCT03887455). Symptoms of infusion reactions are: fever flu-like symptoms (chills, generalized aches, feeling shaky, and joint pain), nausea and vomiting, low blood pressure (hypotension), high blood pressure (hypertension), and oxygen desaturation. Managing infusion-related reactions. If you have an infusion-related reaction, the infusion rate may be reduced, or the infusion may be stopped, and appropriate therapy may be started as clinically indicated. Before future infusions, preventative (prophylactic) treatment with antihistamines, acetaminophen, nonsteroidal anti-inflammatory drugs, or corticosteroids may be considered. The most common side effects occurred in 10% or more of patients and were higher than the side effect incidence compared to placebo.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Leqembi: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Leqembi Print Save Leqembi Play pronunciation Pronunciation: leh-kem’-bee Generic name: lecanemab Other brand names of lecanemab include: Leqembi, Leqembi Iqlik Dosage form: injection for infusion (200 mg/2 mL, 500 mg/5 mL), autoinjector for subcutaneous use (360 mg/1.8 mL) Drug class: Miscellaneous central nervous system agents Medically reviewed by Melisa Puckey, BPharm . Last updated on Nov 20, 2025. Uses"}
{"source_url": "https://www.drugs.com/contepo.html", "site": "drugs.com", "generic_name": "Contepo", "brand_names": "Monurol", "indications": "Contepo is indicated for complicated urinary tract infections (cUTIs), including: Acute pyelonephritis (kidney infection) cUTIs caused by susceptible E. coli cUTIs caused by susceptible K. pneumoniae. The medication is approved only for patients 18 years of age and older.", "mechanism": "Contepo has a unique mechanism of action that may be effective against multi-drug resistant (MDR) bacterial strains that do not respond to conventional antibiotics.", "dosage": "Contepo is administered by a healthcare provider in a clinic or hospital. Given by intravenous infusion over 1 hour. Usually given every 8 hours (3 times a day).", "side_effects": "Elevated liver enzymes (transaminases) Low potassium (hypokalemia) Low white blood cell count (neutropenia) Nausea Vomiting Diarrhea Low calcium (hypocalcemia) High sodium (hypernatremia) Headache Low phosphorus (hypophosphatemia).", "interactions": "Contepo may interact with other medications. Tell your healthcare provider about all the medicines you take. Avoid taking Contepo with other medications that prolong the QT interval, as this may increase the risk of dangerous heart rhythm problems. Contepo drug interactions (more detail) Does Contepo interact with my other drugs? Enter medications to view a detailed interaction report using our Drug Interaction Checker. Drug name Add a drug to check interactions Add", "raw_excerpt": "Contepo: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Contepo Print Save Contepo Pronunciation: con-tep-oh Generic name: fosfomycin Dosage form: single-dose vial for intravenous injection (6 grams) Drug classes: Miscellaneous antibiotics , Urinary anti-infectives Medically reviewed by Carmen Pope, BPharm . Last updated on Oct 23, 2025. Uses Warnings Side effects Before taking Dosage Interactions FAQ What is Contepo? Contepo is used to treat complicated urinary t"}
{"source_url": "https://www.drugs.com/", "site": "drugs.com", "generic_name": "Know more. Be sure.", "brand_names": null, "indications": "Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administration (FDA) has granted approval to Jaypirca (pirtobrutinib,... 4 days ago New Drug Approvals", "mechanism": null, "dosage": "Eli Lilly and Company (NYSE: LLY) today announced that the U.S. Food and Drug Administration (FDA) has granted approval to Jaypirca (pirtobrutinib,...", "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Drugs.com – Know More. Be Sure. Skip to main content Drugs A-Z Pill Identifier Interaction Checker News Pro Edition More Resources Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Know more. Be sure. Drug and health information, from pharmacists you can trust. Search Drugs.com Search Trending searches : Ozempic Mounjaro Ubrelvy Zepbound Botox Dupixent Journavx Austedo Drugs & Medications Pill Identifier Drug Interaction Checker Symptom Checker Side Effects Conditions & Diseases Treatment Guides Compare Drugs My Med List Discount Card FDA Alerts Price Guide Phonetic Search Health Professionals Previous Next Browse Drugs Conditions Symptoms A B C D E F G H I J K L M N O P Q R S T U V W X Y Z 0-9 Advanced Search Browse A-Z: drugs , treatments , conditions , drug classes or symptoms A B C D E F G H I J"}
{"source_url": "https://www.drugs.com/lexapro.html", "site": "drugs.com", "generic_name": "Lexapro", "brand_names": null, "indications": null, "mechanism": "Lexapro weight gain affects up 25 % to 41% of patients who take this antidepressant medication, although weight gain tends to be minimal, with an average gain of approximately 1 % to 3.7%. The weight gain associated with Lexapro occurs primarily due to the drug's mechanism of action on serotonin levels in the brain. When Lexapro blocks the serotonin transporter, it successfully increases serotonin availability to help treat depression and anxiety, but this same action can trigger unwanted changes in appetite and metabolism.", "dosage": "Pronunciation: leks-a-pro Generic name: escitalopram Dosage form: tablets, oral solution Drug class: Selective serotonin reuptake inhibitors", "side_effects": "Common side effects of Lexapro may include: painful urination; dizziness, drowsiness, tiredness, weakness; feeling anxious or agitated; increased muscle movements, feeling shaky; sleep problems (insomnia); sweating, dry mouth, increased thirst, loss of appetite; nausea, constipation; yawning; nosebleed, heavy menstrual periods; or decreased sex drive, impotence, or difficulty having an orgasm.", "interactions": "Many drugs may interact with escitalopram, and some drugs should not be used at the same time. Tell your doctor about all your current medicines and any medicine you start or stop using. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed here.", "raw_excerpt": "Lexapro Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Lexapro Print Save Lexapro Play pronunciation Pronunciation: leks-a-pro Generic name: escitalopram Dosage form: tablets, oral solution Drug class: Selective serotonin reuptake inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on July 1, 2024. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Lexapro? Lexapro (escitalopram) is an antidepressant from the group of drugs ca"}
{"source_url": "https://www.drugs.com/alpha/u.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'U' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z U Drugs: U List of drugs and medications that start with the letter ' U '. Ua Ub Uc Ud Ue Uf Ug Uh Ui Uj Uk Ul Um Un Uo Up Uq Ur Us Ut Uu Uv Uw Ux Uy Uz 0-9 Most Common 'U' Drugs Common medications that begin with the letter ' U ' Patient Info Professional Monographs Ubiquinone Ublituximab Ubrelvy Ubrogepant Uceris Udenyca Ulipristal Uloric Ultiva Ultomiris Ultracet Ultram Ultravate Umeclidinium Umeclidinium"}
{"source_url": "https://www.drugs.com/support/accessibility.html", "site": "drugs.com", "generic_name": "Accessibility statement", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Accessibility statement for www.drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Support Accessibility Accessibility statement Web accessibility is essential for disabled people and useful for everyone in a variety of situations. This accessibility statement applies to the www.drugs.com website. About the accessibility of this website At a minimum, this website aims to: Meet the Web Content Accessibility Guidelines (WCAG) 2.1 at Level AA. Work on the most common browsers, platforms and devices, and with a"}
{"source_url": "https://www.drugs.com/farxiga.html", "site": "drugs.com", "generic_name": "Farxiga", "brand_names": null, "indications": null, "mechanism": "Farxiga mechanism of action involves preventing glucose reabsorption in the kidneys, and increasing how much is excreted in the urine. Farxiga works by inhibiting sodium-glucose cotransporter 2 (SGLT2), which is present in the proximal renal tubules and reabsorbs filtered glucose. By inhibiting this, Farxiga promotes the excretion of glucose in the urine.", "dosage": "Pronunciation: FAR-SEE-GUH Generic name: dapagliflozin Dosage form: oral tablets Drug class: SGLT-2 inhibitors", "side_effects": "The most common side effects of Farxiga are: Female genital yeast infections (vaginal thrush) Urinary tract infections Nasopharyngitis (a runny or stuffy nose).", "interactions": "This list is not complete. Other drugs may interact with dapagliflozin, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Farxiga: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Farxiga Print Save Farxiga Play pronunciation Pronunciation: FAR-SEE-GUH Generic name: dapagliflozin Dosage form: oral tablets Drug class: SGLT-2 inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on Sep 2, 2024. Uses Side effects Before taking Dosage What to avoid Interactions FAQ What is Farxiga? Farxiga (dapagliflozin) is an oral medication that may be given to certain people with diabetes"}
{"source_url": "https://www.drugs.com/alpha/0-9.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with '0-9' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z 0-9 Drugs: 0-9 List of drugs and medications that start with the letters ' 0-9 '. Patient Info Professional Monographs 12 Hour Cold Maximum Strength 12 Hour Nasal 12 Hour Nasal Decongestant 13c urea and citric acid 14c urea 2 in 1 Dandruff 3M Skin and Nasal Antiseptic 4-Way 4-Way Long Lasting 5-HTP 5-HTP Mood and Stress 5-hydroxytryptophan 5-hydroxytryptophan, melatonin, and pyridoxine 60 Second Fluoride Ge"}
{"source_url": "https://www.drugs.com/alpha/j.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'J' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z J Drugs: J List of drugs and medications that start with the letter ' J '. Ja Jb Jc Jd Je Jf Jg Jh Ji Jj Jk Jl Jm Jn Jo Jp Jq Jr Js Jt Ju Jv Jw Jx Jy Jz 0-9 Most Common 'J' Drugs Common medications that begin with the letter ' J ' Patient Info Professional Monographs Jadenu Jaimiess Jakafi Jalyn Jantoven Janumet Janumet XR Januvia Jardiance Jascayd Jatenzo Javadin Jaypirca Jelmyto Jemperli Jencycla Jentadueto"}
{"source_url": "https://www.drugs.com/care_notes.html", "site": "drugs.com", "generic_name": "Micromedex CareNotes", "brand_names": null, "indications": "Micromedex CareNotes provide easy-to-understand information on standard treatments for various diseases and conditions. These resources cover the nature of conditions, potential causes, signs & symptoms, and recommended means of care and support.", "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Micromedex CareNotes Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Micromedex CareNotes Micromedex CareNotes provide easy-to-understand information on standard treatments for various diseases and conditions. These resources cover the nature of conditions, potential causes, signs & symptoms, and recommended means of care and support. Search CareNotes Search Search Examples: arthritis, c-section, insomnia About Micromedex CareNotes These comprehensive documents address all aspects of patient care, including conditions,"}
{"source_url": "https://www.drugs.com/medical_conditions.html", "site": "drugs.com", "generic_name": "Treatment Options", "brand_names": null, "indications": "\"Cancer\" is the term given to a large group of diseases that vary in type and location but have one thing in common: abnormal cells growing out of control. This center contains information on the various causes of cancer, methods of diagnosis and the variety of drugs and treatment options that are available. It also provides detailed information on breast, cervical, lung, prostate and skin cancers.", "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Medical Treatment Options for Diseases & Conditions - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Treatment Options Find your disease or condition and discover what medication options are available for you. Search Search Browse A-Z A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Find common treatments Acne ADHD AIDS/HIV Allergies Alzheimer's Angina Anxiety Asthma Bipolar Disorder Bronchitis Cancer Cholesterol Colds & Flu Constipation COPD Covid 19 Depression Diabetes (Type 1) Diabetes (Type 2) Diarrhe"}
{"source_url": "https://www.drugs.com/xolair.html", "site": "drugs.com", "generic_name": "Xolair", "brand_names": null, "indications": "HCPs and patients often use the Xolair Package Insert (PI) for more detailed information about this medicine. The Xolair Package Insert (prescribing information) contains more comprehensive information on Indications and Usage, Dosage and Administration, Clinical Pharmacology, Clinical Studies, Drug Interaction, and more. Discuss any medical questions you have with your HCP (health care professional). This is not all the information you need to know about this medicine for safe and effective use, and it does not take the place of talking to your doctor about your treatment.", "mechanism": "HCPs and patients often use the Xolair Package Insert (PI) for more detailed information about this medicine. The Xolair Package Insert (prescribing information) contains more comprehensive information on Indications and Usage, Dosage and Administration, Clinical Pharmacology, Clinical Studies, Drug Interaction, and more. Discuss any medical questions you have with your HCP (health care professional). This is not all the information you need to know about this medicine for safe and effective use, and it does not take the place of talking to your doctor about your treatment.", "dosage": "Pronunciation: ZOHL-air Generic name: omalizumab [ OH-ma-LIZ-oo-mab ] Dosage forms: autoinjector, prefilled syringe, vial for reconstitution , Drug class: Selective immunosuppressants", "side_effects": "Common Xolair side effects include: fever; rash; nausea, vomiting, diarrhea, stomach pain; Itching or a skin rash; headache; dizziness; joint pain usually in arms or legs, bone fractures; ear pain, ear infection; swelling in sinuses, nose or throat; throat infection nose bleeds cold symptoms such as stuffy nose, sneezing, sinus pain, cough, sore throat. The most common Xolair side effect is injection site reactions, with symptoms of bruising, redness, warmth, burning, stinging, itching, hive formation, pain, skin indentations, bumps, and inflammation. Injection site reactions occurred in 45% of Xolair patients and 43% of placebo patients. Severe injection site reactions affected 12% of the Xolair treated and 9% of the placebo group. The common Xolair injection side effects vary depending on the condition being treated and the age group of the patient.", "interactions": "This list is not complete. Many other drugs may interact with Xolair, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed in this medication guide.", "raw_excerpt": "Xolair Injection: Uses, Side Effects, Dosage - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Xolair Print Save Xolair Play pronunciation Pronunciation: ZOHL-air Generic name: omalizumab [ OH-ma-LIZ-oo-mab ] Dosage forms: autoinjector, prefilled syringe, vial for reconstitution , Drug class: Selective immunosuppressants Medically reviewed by Melisa Puckey, BPharm . Last updated on Nov 12, 2025. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Xolair? Xolair (omalizumab) is a pres"}
{"source_url": "https://www.drugs.com/skyrizi.html", "site": "drugs.com", "generic_name": "Skyrizi", "brand_names": "Infliximab infusion (brand names Avsola, Inflectra, Remicade, and others) reduces inflammation and ...", "indications": "Clinical trials have demonstrated the efficacy of Skyrizi across its approved indications.", "mechanism": "Skyrizi's mechanism of action is by binding and blocking IL-23 (interleukin-23), a cytokine (protein) involved in inflammation and immune responses. By binding to the p19 subunit of IL-23, Skyrizi blocks its activity, reducing inflammation. This leads to improvement in skin lesions, joint pain, and gastrointestinal symptoms associated with autoimmune conditions.", "dosage": "Pronunciation: sky-RIZZ-ee Generic name: risankizumab [ RIS-an-KIZ-ue-mab ] Dosage form: vial, autoinjector pen, prefilled syringe, prefilled cartridge (supplied on-body injector) Drug class: Interleukin inhibitors", "side_effects": "Common side effects of Skyrizi may include: fever, headache, tiredness stomach pain, joint pain, back pain cold symptoms such as a stuffy nose, sneezing, sore throat pain and burning when you urinate (urinary tract infection) fungal skin infection; low red blood cells (anemia) with symptoms of feeling faint or dizzy, unusually weak or tired, having falls, or trouble breathing injection site reaction, including pain, bruising, swelling, or irritation where the medicine was injected. Skyrizi side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Skyrizi: Uses, Dosage, Side Effects and more Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Skyrizi Print Save Skyrizi Play pronunciation Pronunciation: sky-RIZZ-ee Generic name: risankizumab [ RIS-an-KIZ-ue-mab ] Dosage form: vial, autoinjector pen, prefilled syringe, prefilled cartridge (supplied on-body injector) Drug class: Interleukin inhibitors Medically reviewed by Melisa Puckey, BPharm . Last updated on Nov 11, 2025. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Skyriz"}
{"source_url": "https://www.drugs.com/duloxetine.html", "site": "drugs.com", "generic_name": "Duloxetine", "brand_names": "Cymbalta, Drizalma Sprinkle, Irenka", "indications": "Cyclobenzaprine is a muscle relaxant used for short-term pain relief. Learn about its uses, dosage ...", "mechanism": null, "dosage": "Generic name: duloxetine [ du-LOX-e-teen ] Brand names: Cymbalta, Drizalma Sprinkle, Irenka Dosage form: oral delayed release capsule (20 mg; 30 mg; 40 mg; 60 mg) Drug class: Serotonin-norepinephrine reuptake inhibitors", "side_effects": "Get emergency medical help if you have signs of an allergic reaction to duloxetine (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning eyes, skin pain, red or purple skin rash with blistering and peeling). Tell your doctor right away if you have new or sudden changes in mood or behavior, including new or worse depression or anxiety, panic attacks, trouble sleeping, or if you feel impulsive, irritable, agitated, hostile, aggressive, restless, more active or talkative, or have thoughts about suicide or hurting yourself. Call your doctor at once if you have: pounding heartbeats or fluttering in your chest; a light-headed feeling, like you might pass out; easy bruising, unusual bleeding; vision changes; painful or difficult urination; liver problems - right-sided upper stomach pain, itching, dark urine, jaundice (yellowing of the skin or eyes); low blood sodium - headache, confusion, problems with thinking or memory, weakness, feeling unsteady; or manic episodes - racing thoughts, increased energy, decreased need for sleep, risk-taking behavior, being agitated or talkative. Seek medical attention right away if you have symptoms of serotonin syndrome, such as: agitation, hallucinations, fever, sweating, shivering, fast heart rate, muscle stiffness, twitching, loss of coordination, nausea, vomiting, or diarrhea. Common duloxetine side effects may include: drowsiness; nausea, constipation, loss of appetite; dry mouth; or increased sweating. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Duloxetine side effects (more detail)", "interactions": "Many drugs can interact with duloxetine. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed here. Tell your doctor about all other medicines you use.", "raw_excerpt": "Duloxetine: Uses, Side Effects, Dosage, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Duloxetine Print Save Duloxetine Play pronunciation Generic name: duloxetine [ du-LOX-e-teen ] Brand names: Cymbalta , Drizalma Sprinkle , Irenka Dosage form: oral delayed release capsule (20 mg; 30 mg; 40 mg; 60 mg) Drug class: Serotonin-norepinephrine reuptake inhibitors Medically reviewed by Philip Thornton, DipPharm . Last updated on March 3, 2025. Uses Warnings Before taking Dosage Side effects Interac"}
{"source_url": "https://www.drugs.com/price-guide/", "site": "drugs.com", "generic_name": "Drug Price Information", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Prices, Coupons & Patient Assistance Programs - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Drug Price Information This pricing guide is based on using the Drugs.com discount card , accepted at most U.S. pharmacies. Listed prices are for cash payment only and cannot be combined with insurance plans. The guide includes available manufacturer discounts, such as coupons, savings cards, rebates, free trials, samples, and patient assistance programs (PAPs), based on eligibility criteria. Search drug price guid"}
{"source_url": "https://www.drugs.com/alpha/n.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'N' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z N Drugs: N List of drugs and medications that start with the letter ' N '. Na Nb Nc Nd Ne Nf Ng Nh Ni Nj Nk Nl Nm Nn No Np Nq Nr Ns Nt Nu Nv Nw Nx Ny Nz 0-9 Most Common 'N' Drugs Common medications that begin with the letter ' N ' Patient Info Professional Monographs Nabumetone NAC Nadolol Naloxone Naltrexone Namenda Naprosyn Naproxen Narcan Nasacort Nayzilam Nebivolol Neffy Neomycin Neosporin Nerlynx Neupro"}
{"source_url": "https://www.drugs.com/januvia.html", "site": "drugs.com", "generic_name": "Januvia", "brand_names": "Zituvio", "indications": "Get emergency medical help if you have signs of an allergic reaction to Januvia (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning in your eyes, skin pain, red or purple skin rash that spreads and causes blistering and peeling).", "mechanism": null, "dosage": null, "side_effects": "Get emergency medical help if you have signs of an allergic reaction to Januvia (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning in your eyes, skin pain, red or purple skin rash that spreads and causes blistering and peeling). Stop taking Januvia and call your doctor right away if you have symptoms of pancreatitis: severe pain in your upper stomach spreading to your back, with or without vomiting. Call your doctor at once if you have: severe autoimmune reactionitching, blisters, breakdown of the outer layer of skin; severe or ongoing pain in your joints; little or no urination; or symptoms of heart failureshortness of breath (even while lying down), swelling in your legs or feet, rapid weight gain. Common Januvia side effects may include: low blood sugar; headache; or runny or stuffy nose, sore throat. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Januvia side effects (more detail)", "interactions": "This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed here. Tell your doctor about all medicines you start or stop using.", "raw_excerpt": "Januvia: Uses, Dosage, Side Effects - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Januvia Print Save Januvia Play pronunciation Generic name: sitagliptin [ SI-ta-glip-tin ] Drug class: Dipeptidyl peptidase 4 inhibitors Medically reviewed by Sanjai Sinha, MD . Last updated on Sep 4, 2024. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Januvia? Januvia is an oral diabetes medicine that helps control blood sugar levels. It works by regulating the levels of insulin your body pro"}
{"source_url": "https://www.drugs.com/news/cognitive-decline-can-show-up-early-driving-patterns-127742.html", "site": "drugs.com", "generic_name": "Cognitive Decline Can Show Up Early in Driving Patterns", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Cognitive Decline Can Show Up Early in Driving Patterns - Drugs.com MedNews Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home News Consumer News Print All News Consumer Pro New Drugs Pipeline Clinical Trials FDA Alerts Cognitive Decline Can Show Up Early in Driving Patterns By Ernie Mundell HealthDay Reporter Medically reviewed by Carmen Pope, BPharm . Last updated on Dec 1, 2025. via HealthDay MONDAY, Dec. 1, 2025 — Researchers say changes in folks' driving patterns could be an early signal of cognitive decline. “W"}
{"source_url": "https://www.drugs.com/alpha/w.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'W' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z W Drugs: W List of drugs and medications that start with the letter ' W '. Wa Wb Wc Wd We Wf Wg Wh Wi Wj Wk Wl Wm Wn Wo Wp Wq Wr Ws Wt Wu Wv Ww Wx Wy Wz 0-9 Most Common 'W' Drugs Common medications that begin with the letter ' W ' Patient Info Professional Monographs Wainua Wakix Warfarin Wart Remover Water for Injection Wayrilz Wegovy Welchol Welireg Wellbutrin Wellbutrin SR Wellbutrin XL Westcort Westhroid"}
{"source_url": "https://www.drugs.com/professionals.html", "site": "drugs.com", "generic_name": "For Healthcare Professionals", "brand_names": null, "indications": "Micromedex CareNotes provide easy-to-understand information on standard treatments for various diseases and conditions. These resources cover the nature of conditions, potential causes, signs & symptoms, and recommended means of care and support.", "mechanism": "The Drug Interaction Checker details the pharmacological mechanisms underlying each interaction, classifies significance levels (major, moderate, or minor), and provides evidence-based recommendations for clinical management when applicable.", "dosage": "Product labeling from the United States Food and Drug Administration (FDA) includes professional information, package inserts, and medication guides. This content is sourced directly from manufacturer-compiled, FDA-approved product monographs. Drugs.com reformats these monographs for clarity while maintaining all FDA-approved content.", "side_effects": "Comprehensive information on traditional and conventional uses of natural products, presented with clinical terminology for healthcare professionals. Each detailed monograph includes dosing guidelines, drug interactions, adverse effects, contraindications, and safety/efficacy assessments.", "interactions": "Sign up to Drugs.com to save your drug and interactions lists, receive free FDA Drug Alerts and approvals plus other useful features designed to assist healthcare professionals.", "raw_excerpt": "Drug Information for Healthcare Professionals Skip to main content Search Drugs.com Close Professional Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close For Healthcare Professionals Drugs.com provides access to healthcare information tailored for a professional audience - sourced solely from the most trusted, well-respected and independent agents such as the American Society of Health-System Pharmacists (ASHP), FDA, Truven Health Analytics, Harvard Health and Cerner Multum. Sign up to Drugs.com to save your drug and interactions lists, receive free FDA Drug Alerts and"}
{"source_url": "https://www.drugs.com/trintellix.html", "site": "drugs.com", "generic_name": "Trintellix", "brand_names": null, "indications": "In Europe, Trintellix is marketed under the brand name Brintellix, while in the United States, it is sold as Trintellix. In May 2016, Takeda Pharmaceuticals U.S.A., Inc. and Lundbeck announced that Brintellix will be marketed in the United States under the new name Trintellix, effective June 2016. The change comes after receiving reports of name confusion in the marketplace between Brintellix and the anti-blood clotting therapy Brilinta (ticagrelor). The formulation, indication, dosage forms, and strengths of Trintellix remain the same as Brintellix.", "mechanism": null, "dosage": "Pronunciation: trin’-TELL-ix Generic name: vortioxetine [ VOR-tye-OX-e-teen ] Dosage form: tablets (5 mg, 10 mg, 20mg) Drug class: Miscellaneous antidepressants", "side_effects": "Common Trintellix side effects may include: Nausea 26% Diarrhea 7% Dry mouth 7% Dizziness 6% Constipation 5% Vomiting 5% Gas (flatulence) 3% Itchy skin (pruritus) 2% These common side effects occurred in the 6 to 8-week placebo-controlled studies in patients taking Trintellix 10mg. The frequency of side effects increased with higher doses.", "interactions": "This list is not complete and many other drugs may interact with vortioxetine. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Trintellix Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Trintellix Print Save Trintellix Play pronunciation Pronunciation: trin’-TELL-ix Generic name: vortioxetine [ VOR-tye-OX-e-teen ] Dosage form: tablets (5 mg, 10 mg, 20mg) Drug class: Miscellaneous antidepressants Medically reviewed by Melisa Puckey, BPharm . Last updated on July 29, 2025. Uses Side effects Warnings Before taking Dosage Interactions FAQ What is Trintellix? Trintellix ( vortioxetine ) is a pr"}
{"source_url": "https://www.drugs.com/avastin.html", "site": "drugs.com", "generic_name": "Avastin", "brand_names": "Mvasi, Zirabev, Vegzelma, Alymsys, Avzivi", "indications": "Your doctor may use Avastin (bevacizumab) to treat wet age-related macular degeneration (AMD), diabetic eye disease or other eye problems. It is injected into the eye to help slow vision loss. These uses are considered “off-label” meaning your doctor might use Avastin for unapproved uses if they believe it’s helpful.", "mechanism": null, "dosage": null, "side_effects": "Get emergency medical help if you have signs of an allergic reaction to Avastin: hives, difficult breathing, swelling of your face, lips, tongue, or throat. Some side effects may occur during the injection. Tell your medical caregiver right away if you feel dizzy, nauseated, light-headed, itchy, sweaty, or have a headache, chest tightness, back pain, trouble breathing, or swelling in your face. Bevacizumab can cause a serious but rare neurologic disorder that affects the brain. Symptoms may occur within hours of your first dose or may not appear for up to a year after your treatment started. Call your doctor at once if you have: extreme weakness or tiredness, headache, confusion, vision problems, fainting, or seizures (blackout or convulsions). Bevacizumab can cause you to bleed more easily. Call your doctor or seek emergency medical attention if you have: easy bruising, unusual bleeding, or any bleeding that will not stop; signs of bleeding in your digestive tract - severe stomach pain, bloody or tarry stools, coughing up blood or vomit that looks like coffee grounds; or signs of bleeding in the brain - sudden numbness or weakness, slurred speech, severe headache, problems with vision or balance. Some people taking Avastin have developed a perforation (a hole or tear) or a fistula (an abnormal passageway) in the stomach, intestines, throat, lungs, gallbladder, kidney, bladder, or vagina. Call your doctor if you have severe stomach pain or if you feel like you are choking when you eat or drink. Also call your doctor if you have: slow wound healing; skin infection or open sores; missed menstrual periods; kidney problems - swelling, urinating less, feeling tired or short of breath; signs of a blood clot - chest pain, sudden cough or shortness of breath, dizziness, coughing up blood, pain, swelling, or warmth in one leg; heart problems - chest pain or pressure, pain spreading to your jaw or shoulder, nausea, sweating, swelling, rapid weight gain, feeling short of breath; or low white blood cell counts - fever, mouth sores, skin sores, sore throat, cough. Your cancer treatments may be delayed or permanently discontinued if you have certain side effects. Common Avastin side effects may include: increased blood pressure; headache, back pain; dry or watery eyes; dry or flaky skin; stuffy nose, runny nose, sneezing; or altered sense of taste. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Avastin side effects (more detail)", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Avastin: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Avastin Print Save Avastin Play pronunciation Generic name: bevacizumab [ bev-a-CIZ-oo-mab ] Drug class: VEGF/VEGFR inhibitors Medically reviewed by Philip Thornton, DipPharm . Last updated on July 1, 2025. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Avastin? Avastin injection is used in combination with other chemotherapy medications to treat certain types of colon and rectal canc"}
{"source_url": "https://www.drugs.com/repatha.html", "site": "drugs.com", "generic_name": "Repatha", "brand_names": null, "indications": "Repatha (evolocumab) is an injectable prescription medicine approved: Cardiovascular Risk Reduction: to reduce the risk of major adverse cardiovascular events (MACE), such as death from cardiovascular disease, heart attack, stroke, certain types of chest pain conditions (unstable angina) requiring hospitalization, or certain types of heart surgery, in adults at increased risk for these events Primary Hyperlipidemia Treatment: to reduce LDL-C in adults with primary hyperlipidemia, including heterozygous familial hypercholesterolemia (HeFH) as an adjunct to diet, alone, or in combination with other low-density lipoprotein cholesterol (LDL-C)-lowering therapies Pediatric HeFH Treatment: to reduce LDL-C in children aged 10 years and older with HeFH as an adjunct to diet and other LDL-C-lowering therapies Homozygous Familial Hypercholesterolemia (HoFH): to reduce LDL-C in adults and children aged 10 years and older with HoFH as an adjunct to other LDL-C-lowering therapies. It is not known if Repatha is safe and effective in children with HeFH or HoFH who are younger than 10 years of age or in children with other types of hyperlipidemia. Repatha received FDA approval on August 27, 2015. There is no Repatha generic or biosimilar.", "mechanism": "Repatha works by helping the liver reduce levels of \"bad\" cholesterol (low-density lipoprotein, or LDL) circulating in your blood. Its mechanism involves binding to and blocking a protein called PCSK9 (Proprotein Convertase Subtilisin/Kexin Type 9) in the liver. Normally, PCSK9 attaches to LDL receptors on liver cells and triggers their degradation. These receptors are responsible for removing LDL (\"bad\") cholesterol from the blood. By inhibiting PCSK9, Repatha prevents the degradation of LDL receptors, allowing more of them to remain on liver cell surfaces and remove more LDL cholesterol from the blood. Clinical trials report significant reductions in blood LDL cholesterol levels (often 50-60% or more).", "dosage": "Pronunciation: ri-PAth-a Generic name: evolocumab Dosage form: prefilled single-dose SureClick autoinjector (140 mg/mL), prefilled single-dose syringe (140 mg/mL), single-dose Pushtonex system (420 mg/3.5mL; on-body infusor with prefilled cartridge) Drug class: PCSK9 inhibitors", "side_effects": "The most common side effects of Repatha are: Cold symptoms like a runny nose and sore throat Flu or flu-like symptoms Back pain High blood sugar/diabetes Injection site reactions such as redness, pain, or bruising.", "interactions": "Lipitor is used to treat high cholesterol. Learn about side effects, interactions and indications.", "raw_excerpt": "Repatha: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Repatha Print Save Repatha Play pronunciation Pronunciation: ri-PAth-a Generic name: evolocumab Dosage form: prefilled single-dose SureClick autoinjector (140 mg/mL), prefilled single-dose syringe (140 mg/mL), single-dose Pushtonex system (420 mg/3.5mL; on-body infusor with prefilled cartridge) Drug class: PCSK9 inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 13, 2025. Uses Cost Sid"}
{"source_url": "https://www.drugs.com/alpha/q.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'Q' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z Q Drugs: Q List of drugs and medications that start with the letter ' Q '. Qa Qb Qc Qd Qe Qf Qg Qh Qi Qj Qk Ql Qm Qn Qo Qp Qq Qr Qs Qt Qu Qv Qw Qx Qy Qz 0-9 Most Common 'Q' Drugs Common medications that begin with the letter ' Q ' Patient Info Professional Monographs Qalsody Qbrelis Qbrexza Qelbree QIVIGY Qlosi Qmiiz ODT QNASL Qsymia Qtern Qualaquin Quasense Quassia Quazepam Quercetin Questran Questran Light"}
{"source_url": "https://www.drugs.com/kisqali.html", "site": "drugs.com", "generic_name": "Kisqali", "brand_names": "Pronunciation: Kis kah lee Generic name: ribociclib Other brand names of ribociclib include: Kisqali, Kisqali Femara Co-Pack Dosage form: oral tablet Drug class: CDK 4/6 inhibitors", "indications": null, "mechanism": "Kisqali’s mechanism of action involves blocking cyclin-dependent kinases 4 and 6 (CDK4/6), which are key regulators of the cell cycle. By blocking these enzymes, Kisqali slows or stops the growth of cancer cells. Kisqali is not chemotherapy, it is a targeted treatment. Kisqali is usually used in combination with hormone therapies, such as an aromatase inhibitor or fulvestrant (Faslodex).", "dosage": "Pronunciation: Kis kah lee Generic name: ribociclib Other brand names of ribociclib include: Kisqali, Kisqali Femara Co-Pack Dosage form: oral tablet Drug class: CDK 4/6 inhibitors", "side_effects": "The most common side effects of Kisqali in people with early breast cancer include: Changes in laboratory test results, such as decreased white blood cell counts, decreased red blood cell counts, increased liver function tests, decreased platelet counts, or increased kidney function tests infections nausea headache tiredness. Other common side effects of Kisqali reported in people with advanced or metastatic breast cancer include: diarrhea vomiting constipation hair loss.", "interactions": "Xeloda is used to treat breast and colorectal cancers. Learn about side effects, interactions and ...", "raw_excerpt": "Kisqali: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Kisqali Print Save Kisqali Play pronunciation Pronunciation: Kis kah lee Generic name: ribociclib Other brand names of ribociclib include: Kisqali, Kisqali Femara Co-Pack Dosage form: oral tablet Drug class: CDK 4/6 inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 8, 2024. Uses Side effects Before taking Directions Dosage Interactions FAQ What is Kisqali? Kisqali is a prescription med"}
{"source_url": "https://www.drugs.com/humira.html", "site": "drugs.com", "generic_name": "Humira", "brand_names": "Hadlima, Amjevita, Simlandi, Cyltezo, ... +6 more", "indications": "Humira is used to treat: moderate to severe RA in adults. Humira can be used alone, with methotrexate, or with certain other medicines moderate to severe polyarticular juvenile idiopathic arthritis (JIA) in children 2 years and older. Humira can be used alone or with methotrexate psoriatic arthritis (PsA) in adults. Humira can be used alone or with certain other medicines ankylosing spondylitis (AS) in adults moderate to severe hidradenitis suppurativa (HS) in people 12 years and older moderate to severe Crohn’s disease (CD) in adults and children 6 years of age and older moderate to severe ulcerative colitis (UC) in adults and children 5 years of age and older. It is not known if Humira is effective in people who stopped responding to or could not tolerate TNF-blocker medicines moderate to severe chronic (lasting a long time) plaque psoriasis in adults who have the condition in many areas of their body and who may benefit from taking injections or pills (systemic therapy) or phototherapy (treatment using ultraviolet light alone or with pills) non-infectious intermediate, posterior, and panuveitis in adults and children 2 years of age and older.", "mechanism": "Humira's mechanism of action involves specifically targeting and blocking tumor necrosis factor (TNF)-alpha, a key inflammatory protein in the immune system. This interrupts immune system signals that cause excessive inflammation. Humira belongs to the drug class tumor necrosis factor (TNF) blockers and is also called a biologic.", "dosage": "Pronunciation: Hu-MAR-ah Generic name: adalimumab Dosage form: single-dose prefilled pen (80 mg/0.8 mL, 40 mg/0.8 mL, 40 mg/0.4 mL), single-dose prefilled glass syringe (80 mg/0.8 mL, 40 mg/0.8 mL, 40 mg/0.4 mL, 20 mg/0.4 mL, 20 mg/0.2 mL, 10 mg/0.2 mL, 10 mg/0.1 mL), single-dose glass vial (40 mg/0.8 mL) Drug classes: Antirheumatics, TNF alfa inhibitors", "side_effects": "The most common side effects of Humira include: injection site reactions: redness, rash, swelling, itching, or bruising. These symptoms usually go away within a few days. Call your doctor right away if you have pain, redness, or swelling around the injection site that does not go away within a few days or gets worse upper respiratory infections (including sinus infections) headaches rash.", "interactions": "This list is not complete. Other drugs may interact with adalimumab, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible interactions are listed in this medication guide.", "raw_excerpt": "Humira: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Humira Print Save Humira Play pronunciation Pronunciation: Hu-MAR-ah Generic name: adalimumab Dosage form: single-dose prefilled pen (80 mg/0.8 mL, 40 mg/0.8 mL, 40 mg/0.4 mL), single-dose prefilled glass syringe (80 mg/0.8 mL, 40 mg/0.8 mL, 40 mg/0.4 mL, 20 mg/0.4 mL, 20 mg/0.2 mL, 10 mg/0.2 mL, 10 mg/0.1 mL), single-dose glass vial (40 mg/0.8 mL) Drug classes: Antirheumatics , TNF alfa inhibitors Medically re"}
{"source_url": "https://www.drugs.com/naltrexone.html", "site": "drugs.com", "generic_name": "Naltrexone", "brand_names": "Vivitrol, Revia", "indications": null, "mechanism": "Naltrexone is an opioid antagonist. Its mechanism of action (MOA) is blocking the mu opioid receptor. This medicine also modifies how the hypothalamus, pituitary gland, and adrenal gland (hypothalamic-pituitary-adrenal axis, HPA axis) interact to suppress the amount of alcohol consumed.", "dosage": "Generic name: Naltrexone Brand names: Vivitrol, Naltrexone Tablets Dosage form: intramuscular injection (380 mg), oral tablet (50mg) Drug classes: Antidotes, Drugs used in alcohol dependence", "side_effects": "Common side effects of naltrexone may include nausea, vomiting, loss of appetite, joint pain, muscle cramps, headache, dizziness, drowsiness, sleep problems (insomnia), tooth pain or cold symptoms such as stuffy nose, sneezing, sore throat, feeling, anxious or nervous.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Naltrexone: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Naltrexone Print Save Naltrexone Play pronunciation Generic name: Naltrexone Brand names: Vivitrol , Naltrexone Tablets Dosage form: intramuscular injection (380 mg), oral tablet (50mg) Drug classes: Antidotes , Drugs used in alcohol dependence Medically reviewed by Melisa Puckey, BPharm . Last updated on April 30, 2024. Uses Side effects Before taking Warnings Dosage Interactions FAQ What is naltrexone? Na"}
{"source_url": "https://www.drugs.com/kygevvi.html", "site": "drugs.com", "generic_name": "Kygevvi", "brand_names": null, "indications": "There are no absolute contraindications for Kygevvi.", "mechanism": null, "dosage": "Pronunciation: KYE-gev-vi Generic name: doxecitine and doxribtimine Dosage form: powder for oral solution (2 gram/2 gram)", "side_effects": "The most common side effects (occurring in 5% or more of patients) include: Diarrhea Abdominal pain or upper abdominal pain Vomiting Increased liver enzymes (ALT and AST).", "interactions": "Based on laboratory studies, doxecitine and doxribtimine do not interact with common drug-processing enzymes (CYP enzymes) or most drug transporters at therapeutic levels. However, you should still tell your doctor about all medications, vitamins, and supplements you take. Does Kygevvi interact with my other drugs? Enter medications to view a detailed interaction report using our Drug Interaction Checker. Drug name Add a drug to check interactions Add", "raw_excerpt": "Kygevvi TK2d: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Kygevvi Print Save Kygevvi Play pronunciation Pronunciation: KYE-gev-vi Generic name: doxecitine and doxribtimine Dosage form: powder for oral solution (2 gram/2 gram) Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 6, 2025. Uses Overview Before taking Directions Side effects Interactions What is Kygevvi? Kygevvi is used to treat thymidine kinase 2 deficiency (TK2d) in adults and children"}
{"source_url": "https://www.drugs.com/alpha/s.html", "site": "drugs.com", "generic_name": "Drugs", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "List of Drugs that start with 'S' - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Drugs A to Z S Drugs: S List of drugs and medications that start with the letter ' S '. Sa Sb Sc Sd Se Sf Sg Sh Si Sj Sk Sl Sm Sn So Sp Sq Sr Ss St Su Sv Sw Sx Sy Sz 0-9 Most Common 'S' Drugs Common medications that begin with the letter ' S ' Patient Info Professional Monographs Sabril Sacubitril and valsartan Salbutamol Salmeterol Sandostatin Saphnelo satralizumab Scopolamine selumetinib Semaglutide Senna Senokot Serniv"}
{"source_url": "https://www.drugs.com/venclexta.html", "site": "drugs.com", "generic_name": "Venclexta", "brand_names": null, "indications": "Venclexta is used to treat adults with: chronic lymphocytic leukemia (CLL) or small lymphocytic lymphoma (SLL) newly diagnosed acute myeloid leukemia (AML) who are 75 years of age or older or who have other medical conditions that prevent the use of standard chemotherapy. For AML, Venclexta is used in combination with azacitidine, decitabine, or low-dose cytarabine. It is not known if Venclexta is safe and effective in children.", "mechanism": "Venclexta's mechanism of action involves targeting a specific protein called BCL-2. BCL-2 acts like a cell's on/off switch for death, preventing cells from programmed cell death (apoptosis). Cancerous blood cells, particularly in CLL, SLL, and AML, often overproduce BCL-2, making them resistant to traditional chemotherapy. Venclexta binds directly to BCL-2, turning the cell's death switch back on and triggering apoptosis. Venclexta is not chemotherapy, it is a targeted treatment (see Is Venclexta chemotherapy? for more information).", "dosage": "The dosage of Venclexta is usually increased slowly over 5 weeks, as described by the Venclexta Package Insert: Week 1: Venclexta 20 mg 1 time a day Week 2: Venclexta 50 mg 1 time a day Week 3: Venclexta 100 mg 1 time a day Week 4: Venclexta 200 mg 1 time a day Week 5 and beyond: Vencelxta 400 mg 1 time a day. The Venclexta Starting Pack provides the first 4 weeks of venetoclax according to the ramp-up schedule. The ongoing dosage of Venclexta is 400 mg once daily after completion of the 5-week ramp-up dosing schedule. Venclexta should be continued until disease progression or unacceptable toxicity occurs.", "side_effects": "The most common side effects of Venclexta are: Laboratory test changes, such as low white cell counts, low platelet counts, and low red blood cell counts Diarrhea Nausea Upper respiratory tract infections (such as a cold) Cough Muscle and joint pain Tiredness Swelling of your arms, legs, hands, and feet. Other side effects that are common when Venclexta is used to treat AML include: Constipation Fever Vomiting Shortness of breath Bleeding Rash Stomach (abdominal) pain An infection in your blood Muscle and joint pain Dizziness Sore throat Low blood pressure.", "interactions": "Not all possible interactions are listed here. See the prescribing information for a full list of interactions.", "raw_excerpt": "Venclexta: Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Venclexta Print Save Venclexta Play pronunciation Pronunciation: ven-KLEKS-tuh Generic name: venetoclax Dosage form: oral tablets Drug class: Miscellaneous antineoplastics Medically reviewed by Carmen Pope, BPharm . Last updated on Dec 10, 2024. Uses Side effects Before taking Dosage What to avoid Interactions FAQ What is Venclexta? Venclexta may be used to treat adults with chronic lymphocytic leukemia (CL"}
{"source_url": "https://www.drugs.com/methadone.html", "site": "drugs.com", "generic_name": "Methadone", "brand_names": "Dolophine, Methadose, Methadone Diskets", "indications": "Opioid medicine can slow or stop your breathing, and death may occur. A person caring for you should give naloxone and/or seek emergency medical attention if you have slow breathing with long pauses, blue colored lips, or if you are hard to wake up.", "mechanism": null, "dosage": "Generic name: methadone (oral/injection) [ METH-a-done ] Brand names: Dolophine, Methadose, Methadose Sugar-Free, Diskets Dosage forms: injectable solution, intravenous solution, oral concentrate, oral solution, oral tablet, oral tablet, dispersible. Drug class: Opioids (narcotic analgesics)", "side_effects": "Get emergency medical help if you have signs of an allergic reaction to methadone: hives; difficult breathing; swelling of your face, lips, tongue, or throat. Opioid medicine can slow or stop your breathing, and death may occur. A person caring for you should give naloxone and/or seek emergency medical attention if you have slow breathing with long pauses, blue colored lips, or if you are hard to wake up.", "interactions": "There are many dangerous drug interactions with methadone. Tell your prescribing doctor about all medications that you take. See “What other drugs will affect methadone?” section below.", "raw_excerpt": "Methadone: Uses, Dose, Side Effects, Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Methadone Print Save Methadone Play pronunciation Generic name: methadone (oral/injection) [ METH-a-done ] Brand names: Dolophine , Methadose , Methadose Sugar-Free, Diskets Dosage forms: injectable solution, intravenous solution, oral concentrate, oral solution, oral tablet, oral tablet, dispersible. Drug class: Opioids (narcotic analgesics) Medically reviewed by Melisa Puckey, BPharm . Last updated on Aug 23, 2023. Use"}
{"source_url": "https://www.drugs.com/clotic.html", "site": "drugs.com", "generic_name": "Clotic", "brand_names": null, "indications": "Do not use Clotic if: You are allergic to clotrimazole or any ingredients in Clotic Check the ingredient list at the end of this guide. Important: Clotic has only been studied in patients with intact tympanic membranes. Its safety and effectiveness in patients with perforated eardrums have not been established.", "mechanism": "Clotic contains clotrimazole, an azole antifungal agent that works by: Blocking fungal enzyme production that fungi need to survive Damaging fungal cell walls, causing the cells to break down and die Disrupting fungal growth by interfering with essential cell processes.", "dosage": "Read the detailed Instructions for Use that come with Clotic. Use Clotic exactly as your healthcare provider tells you to use it. Clotic is for use in the ear only (otic use). Clotic comes as a liquid in single-dose vials. Warm the dose of Clotic by holding the vial in your hand for 1 to 2 minutes to prevent dizziness. Apply the entire dose of Clotic from a single-dose vial into the affected ear 2 times a day. Each dose should be about 12 hours apart. If your symptoms do not improve after 14 days of treatment with Clotic, call your healthcare provider", "side_effects": "The most frequently reported side effects of Clotic include: Headache Application site pain (ear discomfort) Eardrum perforation (ruptured tympanic membrane) Tinnitus (ringing in the ears) Paresthesia (tingling, tickling, or burning sensation). Important: This is not a complete list of side effects. Contact your healthcare provider if you experience any concerning symptoms. You may report side effects to the FDA at 1-800-FDA-1088.", "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Clotic: Uses, Side Effects, Warnings, & Dosage - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Clotic Print Save Clotic Play pronunciation Pronunciation: cloh-tic Generic name: clotrimazole otic solution Dosage form: ear drops (1%/0.17mL) Medically reviewed by Carmen Pope, BPharm . Last updated on Oct 1, 2025. Uses Side effects Before taking Directions Dosage Interactions What is Clotic? Fungal Ear Infection Treatment Clotic is an antifungal ear drop used to treat fungal otitis externa (otomycosis) in"}
{"source_url": "https://www.drugs.com/gemtesa.html", "site": "drugs.com", "generic_name": "Gemtesa", "brand_names": null, "indications": "Yes, men can take Gemtesa (vibegron) for the treatment of overactive bladder (OAB). Overactive bladder is a condition that causes symptoms of urinary incontinence, urgency, and frequency.", "mechanism": "Gemtesa's mechanism of action (MOA)is by binding and activating β3-adrenergic receptor, which relaxes the muscles in the wall of the bladder (detrusor muscle), which increases bladder volume.", "dosage": "Pronunciation: gem tes' ah Generic name: vibegron Dosage form: tablet 75mg Drug class: Urinary antispasmodics", "side_effects": "The most common Gemtesa side effects for OAB include: headache (22%) cold symptoms -nasopharyngitis (15%) diarrhea (12%) nausea (12%) These common side effects occurred in 2% or more of the Gemtesa patients in the 12-week clinical trial for OAB called Study 3003. The long-term 52-week study had the same side effects as above and also included urinary tract infection (6.6%) and bronchitis (2.9%). The most common Gemtesa side effects for OAB with BPH include: In a 12-week clinical trial (Study 3005) evaluating Gemtesa in males with overactive bladder (OAB) who were also taking medication for benign prostatic hyperplasia (BPH), the most common side effects occurring in more than 2% of patients were: Hypertension: 9% (compared to 8.3% with placebo) Urinary tract infection: 2.5% (compared to 2.2% with placebo)", "interactions": "This list is not complete. Other drugs may interact with vibegron, including prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Gemtesa: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Gemtesa Print Save Gemtesa Play pronunciation Pronunciation: gem tes' ah Generic name: vibegron Dosage form: tablet 75mg Drug class: Urinary antispasmodics Medically reviewed by Melisa Puckey, BPharm . Last updated on Sep 10, 2025. Uses Cost Side effects Warnings Dosage Interactions FAQ What is Gemtesa? Gemtesa is used to treat overactive bladder (OAB) symptoms, including urinary urgency, urinary frequency, an"}
{"source_url": "https://www.drugs.com/qulipta.html", "site": "drugs.com", "generic_name": "Qulipta", "brand_names": null, "indications": null, "mechanism": "Qulipta's mechanism of action involves blocking the effect of CGRP, a small protein that is highly prevalent in the sensory nerves that supply the head and neck. CGRP is involved in pain transmission, inflammation, and blood vessel dilation, and research has shown that levels of CGRP increase during a migraine attack. It may also play a causative role in the initiation of migraine attacks. By blocking CGRP, Qulipta helps prevent migraine headaches (see How does Qulipta work? for more information).", "dosage": "Dosage adjustments are needed when Qulipta is taken with certain other medications and for people with severe kidney disease. Interacting Drug or Condition Recommended Episodic Migraine Once-Daily Dosage Recommended Chronic Migraine Once-Daily Dosage Strong CYP3A4 Inhibitors (eg, itraconazole, erythromycin) 10mg 10 mg Strong and Moderate CYP3A4 Inducers (eg, rifampicin, dexamethasone) 60 mg* Not recommended Weak CYP3A4 Inducers (eg, topiramate) 30 mg or 60 mg 60 mg* OATP Inhibitors (eg, cyclosporine, gemfibrozil) 10 mg or 30 mg 30 mg Renal Impairment Severe Renal Impairment and End-Stage Renal Disease (CLCR <30 mL/min) 10 mg Not recommended * Coadministration reduces Qulipta exposure. Monitor for reduced effectiveness. Detailed Qulipta dosage information", "side_effects": "The most common side effects of Qulipta are: Nausea Constipation Fatigue and drowsiness (feeling tired or sleepy).", "interactions": "This list is not complete, and many other drugs may affect Qulipta. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Qulipta: Uses, Dosage, Side Effects, Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Qulipta Print Save Qulipta Play pronunciation Pronunciation: kew-LIP-tah Generic name: atogepant Dosage form: oral tablet (10 mg, 30 mg, 60 mg) Drug class: CGRP inhibitors Medically reviewed by Carmen Pope, BPharm . Last updated on Nov 30, 2025. Uses Side effects Before taking Dosage Cost Interactions FAQ What is Qulipta? Qulipta is used to help prevent episodic and chronic migraine headaches in adults. These"}
{"source_url": "https://www.drugs.com/sitemap.html", "site": "drugs.com", "generic_name": "Drugs.com Content and Services Guide", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Drugs.com Sitemap Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Drugs.com Content and Services Guide Our mission is to provide the most accurate, up-to-date drug information on the Internet. Drug information Tools & resources Health professionals News Community Reference Support & privacy Español / Spanish Drug information A to Z Drugs Breastfeeding Conditions Consumer information Consumer information (Advanced) Dosage Drug classification Drug Pricing Generic drugs International drugs OTC medicines Pregnancy Side eff"}
{"source_url": "https://www.drugs.com/mtm/", "site": "drugs.com", "generic_name": "Multum Consumer Information", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": "Multum medication guides provide comprehensive consumer drug information, including detailed descriptions, drug interactions, potential side effects, actions required for missed doses and overdosing, and proper usage instructions. These evidence-based resources are available in English and Spanish.", "interactions": "Multum medication guides provide comprehensive consumer drug information, including detailed descriptions, drug interactions, potential side effects, actions required for missed doses and overdosing, and proper usage instructions. These evidence-based resources are available in English and Spanish.", "raw_excerpt": "Cerner Multum Consumer Drug Information Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Multum Consumer Information Multum medication guides provide comprehensive consumer drug information, including detailed descriptions, drug interactions, potential side effects, actions required for missed doses and overdosing, and proper usage instructions. These evidence-based resources are available in English and Spanish . Search Multum consumer information Search Search Examples: amoxicillin, ibuprofen, lexapro Popular drugs Am"}
{"source_url": "https://www.drugs.com/prozac.html", "site": "drugs.com", "generic_name": "Prozac", "brand_names": "Sarafem, Rapiflux, Selfemra", "indications": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use Prozac only for the indication prescribed.", "mechanism": null, "dosage": null, "side_effects": "Get emergency medical help if you have signs of an allergic reaction to Prozac (hives, difficult breathing, swelling in your face or throat) or a severe skin reaction (fever, sore throat, burning eyes, skin pain, red or purple skin rash with blistering and peeling). Report any new or worsening symptoms to your doctor, such as: mood or behavior changes, anxiety, panic attacks, trouble sleeping, or if you feel impulsive, irritable, agitated, hostile, aggressive, restless, hyperactive (mentally or physically), more depressed, or have thoughts about suicide or hurting yourself. Prozac may cause serious side effects. Call your doctor at once if you have: blurred vision, tunnel vision, eye pain or swelling, or seeing halos around lights; fast or pounding heartbeats, fluttering in your chest, shortness of breath, and sudden dizziness (like you might pass out); low levels of sodium in the body - headache, confusion, slurred speech, severe weakness, vomiting, loss of coordination, feeling unsteady; or severe nervous system reaction - very stiff (rigid) muscles, high fever, sweating, confusion, fast or uneven heartbeats, tremors, feeling like you might pass out. Seek medical attention right away if you have symptoms of serotonin syndrome, such as: agitation, hallucinations, fever, sweating, shivering, fast heart rate, muscle stiffness, twitching, loss of coordination, nausea, vomiting, or diarrhea. Common side effects of Prozac may include: sleep problems (insomnia), strange dreams; headache, dizziness, drowsiness, vision changes; tremors or shaking, feeling anxious or nervous; pain, weakness, yawning, tired feeling; upset stomach, loss of appetite, nausea, vomiting, diarrhea; dry mouth, sweating, hot flashes; changes in weight or appetite; stuffy nose, sinus pain, sore throat, flu symptoms; or decreased sex drive, impotence, or difficulty having an orgasm. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. Prozac side effects (more detail)", "interactions": "This list is not complete and many other drugs may interact with fluoxetine. This includes prescription and over-the-counter medicines, vitamins, and herbal products. Not all possible drug interactions are listed here.", "raw_excerpt": "Prozac Uses, Dosage, Side Effects & Warnings - Drugs.com Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Home Prozac Print Save Prozac Play pronunciation Generic name: fluoxetine [ floo-OX-e-teen ] Other brand names of fluoxetine include: Prozac, Prozac Weekly Drug class: Selective serotonin reuptake inhibitors Medically reviewed by Sophia Entringer, PharmD . Last updated on Nov 21, 2023. Uses Warnings Before taking Dosage Side effects Interactions FAQ What is Prozac? Prozac is a selective serotonin reuptake inhibitor"}
{"source_url": "https://www.drugs.com/vet/", "site": "drugs.com", "generic_name": "Veterinary Products", "brand_names": null, "indications": null, "mechanism": null, "dosage": null, "side_effects": null, "interactions": "Access drug & treatment information, identify pills, check interactions and set up personal medication records.", "raw_excerpt": "Veterinary Drugs & Treatments Skip to main content Search Drugs.com Close All Select the section you want to search in All Consumer Professional Pill ID Interactions News and alerts Care notes Natural products Search Browse medications: a b c d e f g h i j k l m n o p q r s t u v w x y z 0-9 Advanced Search Register Sign in Site navigation Upgrade to a Plus Plan Remove ads and unlock more features. Account Sign in Create an account Drugs A-Z Pill Identifier Drug Interaction Checker Compare Drugs News Pro Edition More Resources Help & Support Close Veterinary Products Access the most comprehensive veterinary product reference available, featuring more than 5,000 detailed monographs across pharmaceuticals, biologics, diagnostics, feed medications, and parasiticides. These resources are organized by species and treatment category, providing care options for pets, livestock, and numerous exotic species . Search veterinary information Search Search Examples: atropine sulfate, denamarin, tre"}
